
File: kernel
ELF Header:
  Magic:   7f 45 4c 46 01 01 01 00 00 00 00 00 00 00 00 00 
  Class:                             ELF32
  Data:                              2's complement, little endian
  Version:                           1 (current)
  OS/ABI:                            UNIX - System V
  ABI Version:                       0
  Type:                              EXEC (Executable file)
  Machine:                           Intel 80386
  Version:                           0x1
  Entry point address:               0xc0100ec0
  Start of program headers:          52 (bytes into file)
  Start of section headers:          39144 (bytes into file)
  Flags:                             0x0
  Size of this header:               52 (bytes)
  Size of program headers:           32 (bytes)
  Number of program headers:         3
  Size of section headers:           40 (bytes)
  Number of section headers:         17
  Section header string table index: 14

Section Headers:
  [Nr] Name              Type            Addr     Off    Size   ES Flg Lk Inf Al
  [ 0]                   NULL            00000000 000000 000000 00      0   0  0
  [ 1] .text             PROGBITS        c0100000 001000 001347 00  AX  0   0 16
  [ 2] .rodata           PROGBITS        c0101348 002348 000243 00   A  0   0  4
  [ 3] .eh_frame         PROGBITS        c010158c 00258c 0004e8 00   A  0   0  4
  [ 4] .data             PROGBITS        c0102000 003000 00015c 00  WA  0   0 32

    <69a>   DW_AT_low_pc      : 0xc0100340	
    <69e>   DW_AT_high_pc     : 0xc0100348	
    <6a2>   DW_AT_call_file   : 1	
    <6a3>   DW_AT_call_line   : 13	
 <3><6a4>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <6a5>   DW_AT_abstract_origin: <0x59c>	
    <6a9>   DW_AT_const_value : 11	
 <3><6aa>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <6ab>   DW_AT_abstract_origin: <0x591>	
    <6af>   DW_AT_const_value : 1020	
 <1><6b3>: Abbrev Number: 10 (DW_TAG_subprogram)
    <6b4>   DW_AT_external    : 1	
    <6b5>   DW_AT_name        : (indirect string, offset: 0x114): serial_printc	
    <6b9>   DW_AT_decl_file   : 1	
    <6ba>   DW_AT_decl_line   : 22	
    <6bb>   DW_AT_prototyped  : 1	
    <6bc>   DW_AT_low_pc      : 0xc0100350	
    <6c0>   DW_AT_high_pc     : 0xc010036f	
    <6c4>   DW_AT_frame_base  : 0x5ba	(location list)
    <6c8>   DW_AT_sibling     : <0x733>	
 <2><6cc>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <6cd>   DW_AT_name        : ch	
    <6d0>   DW_AT_decl_file   : 1	
    <6d1>   DW_AT_decl_line   : 22	
    <6d2>   DW_AT_type        : <0x54a>	
    <6d6>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <2><6d9>: Abbrev Number: 11 (DW_TAG_inlined_subroutine)
    <6da>   DW_AT_abstract_origin: <0x5a8>	
    <6de>   DW_AT_entry_pc    : 0xc0100351	
    <6e2>   DW_AT_ranges      : 0x88	
    <6e6>   DW_AT_call_file   : 1	
    <6e7>   DW_AT_call_line   : 23	
    <6e8>   DW_AT_sibling     : <0x713>	
 <3><6ec>: Abbrev Number: 18 (DW_TAG_inlined_subroutine)
    <6ed>   DW_AT_abstract_origin: <0x55c>	
    <6f1>   DW_AT_entry_pc    : 0xc0100351	
    <6f5>   DW_AT_ranges      : 0xa0	
    <6f9>   DW_AT_call_file   : 1	
    <6fa>   DW_AT_call_line   : 18	
 <4><6fb>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <6fc>   DW_AT_abstract_origin: <0x56d>	
    <700>   DW_AT_const_value : 1021	
 <4><702>: Abbrev Number: 19 (DW_TAG_lexical_block)
    <703>   DW_AT_ranges      : 0xb8	
 <5><707>: Abbrev Number: 20 (DW_TAG_variable)
    <708>   DW_AT_abstract_origin: <0x578>	
    <70c>   DW_AT_location    : 0x5f2	(location list)
 <2><713>: Abbrev Number: 16 (DW_TAG_inlined_subroutine)
    <714>   DW_AT_abstract_origin: <0x584>	
    <718>   DW_AT_low_pc      : 0xc0100365	
    <71c>   DW_AT_high_pc     : 0xc010036d	
    <720>   DW_AT_call_file   : 1	
    <721>   DW_AT_call_line   : 24	
 <3><722>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <723>   DW_AT_abstract_origin: <0x59c>	
    <727>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <3><72a>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <72b>   DW_AT_abstract_origin: <0x591>	
    <72f>   DW_AT_const_value : 1016	
 <1><733>: Abbrev Number: 22 (DW_TAG_variable)
    <734>   DW_AT_name        : (indirect string, offset: 0x4a): dummy	
    <738>   DW_AT_decl_file   : 4	
    <739>   DW_AT_decl_line   : 8	
    <73a>   DW_AT_type        : <0x744>	
    <73e>   DW_AT_location    : 5 byte block: 3 28 30 10 c0 	(DW_OP_addr: c0103028)
 <1><744>: Abbrev Number: 23 (DW_TAG_volatile_type)
    <745>   DW_AT_type        : <0x518>	
  Compilation Unit @ offset 0x74a:
   Length:        0x497 (32-bit)
   Version:       2
   Abbrev Offset: 1061
   Pointer Size:  4
 <0><755>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <756>   DW_AT_producer    : (indirect string, offset: 0x81): GNU C 4.6.3	
    <75a>   DW_AT_language    : 1	(ANSI C)
    <75b>   DW_AT_name        : (indirect string, offset: 0x163): src/kernel/irq/irq_handle.c	
    <75f>   DW_AT_comp_dir    : (indirect string, offset: 0x13): /home/lin/code/cslab/os-lab1	
    <763>   DW_AT_low_pc      : 0xc0100370	
    <767>   DW_AT_high_pc     : 0xc0100583	
    <76b>   DW_AT_stmt_list   : 0x27e	
 <1><76f>: Abbrev Number: 2 (DW_TAG_typedef)
    <770>   DW_AT_name        : (indirect string, offset: 0x78): uint32_t	
    <774>   DW_AT_decl_file   : 3	
    <775>   DW_AT_decl_line   : 7	
    <776>   DW_AT_type        : <0x77a>	
 <1><77a>: Abbrev Number: 3 (DW_TAG_base_type)
    <77b>   DW_AT_byte_size   : 4	
    <77c>   DW_AT_encoding    : 7	(unsigned)
    <77d>   DW_AT_name        : (indirect string, offset: 0x6): unsigned int	
 <1><781>: Abbrev Number: 2 (DW_TAG_typedef)
    <782>   DW_AT_name        : (indirect string, offset: 0x79): int32_t	
    <786>   DW_AT_decl_file   : 3	
    <787>   DW_AT_decl_line   : 8	
    <788>   DW_AT_type        : <0x78c>	
 <1><78c>: Abbrev Number: 4 (DW_TAG_base_type)
    <78d>   DW_AT_byte_size   : 4	
    <78e>   DW_AT_encoding    : 5	(signed)
    <78f>   DW_AT_name        : int	
 <1><793>: Abbrev Number: 3 (DW_TAG_base_type)
    <794>   DW_AT_byte_size   : 2	
    <795>   DW_AT_encoding    : 7	(unsigned)
    <796>   DW_AT_name        : (indirect string, offset: 0x0): short unsigned int	
 <1><79a>: Abbrev Number: 3 (DW_TAG_base_type)
    <79b>   DW_AT_byte_size   : 2	
    <79c>   DW_AT_encoding    : 5	(signed)
    <79d>   DW_AT_name        : (indirect string, offset: 0x9f): short int	
 <1><7a1>: Abbrev Number: 2 (DW_TAG_typedef)
    <7a2>   DW_AT_name        : (indirect string, offset: 0xd7): uint8_t	
    <7a6>   DW_AT_decl_file   : 3	
    <7a7>   DW_AT_decl_line   : 11	
    <7a8>   DW_AT_type        : <0x7ac>	
 <1><7ac>: Abbrev Number: 3 (DW_TAG_base_type)
    <7ad>   DW_AT_byte_size   : 1	
    <7ae>   DW_AT_encoding    : 8	(unsigned char)
    <7af>   DW_AT_name        : (indirect string, offset: 0x6a): unsigned char	
 <1><7b3>: Abbrev Number: 3 (DW_TAG_base_type)
    <7b4>   DW_AT_byte_size   : 1	
    <7b5>   DW_AT_encoding    : 6	(signed char)
    <7b6>   DW_AT_name        : (indirect string, offset: 0x73): char	
 <1><7ba>: Abbrev Number: 5 (DW_TAG_structure_type)
    <7bb>   DW_AT_name        : (indirect string, offset: 0x17f): TrapFrame	
    <7bf>   DW_AT_byte_size   : 76	
    <7c0>   DW_AT_decl_file   : 4	
    <7c1>   DW_AT_decl_line   : 111	
    <7c2>   DW_AT_sibling     : <0x8cb>	
 <2><7c6>: Abbrev Number: 6 (DW_TAG_member)
    <7c7>   DW_AT_name        : edi	
    <7cb>   DW_AT_decl_file   : 4	
    <7cc>   DW_AT_decl_line   : 112	
    <7cd>   DW_AT_type        : <0x76f>	
    <7d1>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><7d4>: Abbrev Number: 6 (DW_TAG_member)
    <7d5>   DW_AT_name        : esi	
    <7d9>   DW_AT_decl_file   : 4	
    <7da>   DW_AT_decl_line   : 112	
    <7db>   DW_AT_type        : <0x76f>	
    <7df>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><7e2>: Abbrev Number: 6 (DW_TAG_member)
    <7e3>   DW_AT_name        : ebp	
    <7e7>   DW_AT_decl_file   : 4	
    <7e8>   DW_AT_decl_line   : 112	
    <7e9>   DW_AT_type        : <0x76f>	
    <7ed>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><7f0>: Abbrev Number: 6 (DW_TAG_member)
    <7f1>   DW_AT_name        : xxx	
    <7f5>   DW_AT_decl_file   : 4	
    <7f6>   DW_AT_decl_line   : 112	
    <7f7>   DW_AT_type        : <0x76f>	
    <7fb>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><7fe>: Abbrev Number: 6 (DW_TAG_member)
    <7ff>   DW_AT_name        : ebx	
    <803>   DW_AT_decl_file   : 4	
    <804>   DW_AT_decl_line   : 112	
    <805>   DW_AT_type        : <0x76f>	
    <809>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><80c>: Abbrev Number: 6 (DW_TAG_member)
    <80d>   DW_AT_name        : edx	
    <811>   DW_AT_decl_file   : 4	
    <812>   DW_AT_decl_line   : 112	
    <813>   DW_AT_type        : <0x76f>	
    <817>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><81a>: Abbrev Number: 6 (DW_TAG_member)
    <81b>   DW_AT_name        : ecx	
    <81f>   DW_AT_decl_file   : 4	
    <820>   DW_AT_decl_line   : 112	
    <821>   DW_AT_type        : <0x76f>	
    <825>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><828>: Abbrev Number: 6 (DW_TAG_member)
    <829>   DW_AT_name        : eax	
    <82d>   DW_AT_decl_file   : 4	
    <82e>   DW_AT_decl_line   : 112	
    <82f>   DW_AT_type        : <0x76f>	
    <833>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><836>: Abbrev Number: 6 (DW_TAG_member)
    <837>   DW_AT_name        : gs	
    <83a>   DW_AT_decl_file   : 4	
    <83b>   DW_AT_decl_line   : 113	
    <83c>   DW_AT_type        : <0x76f>	
    <840>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><843>: Abbrev Number: 6 (DW_TAG_member)
    <844>   DW_AT_name        : fs	
    <847>   DW_AT_decl_file   : 4	
    <848>   DW_AT_decl_line   : 113	
    <849>   DW_AT_type        : <0x76f>	
    <84d>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><850>: Abbrev Number: 6 (DW_TAG_member)
    <851>   DW_AT_name        : es	
    <854>   DW_AT_decl_file   : 4	
    <855>   DW_AT_decl_line   : 113	
    <856>   DW_AT_type        : <0x76f>	
    <85a>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><85d>: Abbrev Number: 6 (DW_TAG_member)
    <85e>   DW_AT_name        : ds	
    <861>   DW_AT_decl_file   : 4	
    <862>   DW_AT_decl_line   : 113	
    <863>   DW_AT_type        : <0x76f>	
    <867>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><86a>: Abbrev Number: 6 (DW_TAG_member)
    <86b>   DW_AT_name        : irq	
    <86f>   DW_AT_decl_file   : 4	
    <870>   DW_AT_decl_line   : 114	
    <871>   DW_AT_type        : <0x781>	
    <875>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><878>: Abbrev Number: 7 (DW_TAG_member)
    <879>   DW_AT_name        : (indirect string, offset: 0x198): error_code	
    <87d>   DW_AT_decl_file   : 4	
    <87e>   DW_AT_decl_line   : 115	
    <87f>   DW_AT_type        : <0x76f>	
    <883>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><886>: Abbrev Number: 6 (DW_TAG_member)
    <887>   DW_AT_name        : eip	
    <88b>   DW_AT_decl_file   : 4	
    <88c>   DW_AT_decl_line   : 116	
    <88d>   DW_AT_type        : <0x76f>	
    <891>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><894>: Abbrev Number: 6 (DW_TAG_member)
    <895>   DW_AT_name        : cs	
    <898>   DW_AT_decl_file   : 4	
    <899>   DW_AT_decl_line   : 116	
    <89a>   DW_AT_type        : <0x76f>	
    <89e>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><8a1>: Abbrev Number: 7 (DW_TAG_member)
    <8a2>   DW_AT_name        : (indirect string, offset: 0x189): eflags	
    <8a6>   DW_AT_decl_file   : 4	
    <8a7>   DW_AT_decl_line   : 116	
    <8a8>   DW_AT_type        : <0x76f>	
    <8ac>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><8af>: Abbrev Number: 6 (DW_TAG_member)
    <8b0>   DW_AT_name        : esp	
    <8b4>   DW_AT_decl_file   : 4	
    <8b5>   DW_AT_decl_line   : 117	
    <8b6>   DW_AT_type        : <0x76f>	
    <8ba>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><8bd>: Abbrev Number: 6 (DW_TAG_member)
    <8be>   DW_AT_name        : ss	
    <8c1>   DW_AT_decl_file   : 4	
    <8c2>   DW_AT_decl_line   : 117	
    <8c3>   DW_AT_type        : <0x76f>	
    <8c7>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <1><8cb>: Abbrev Number: 2 (DW_TAG_typedef)
    <8cc>   DW_AT_name        : (indirect string, offset: 0x17f): TrapFrame	
    <8d0>   DW_AT_decl_file   : 4	
    <8d1>   DW_AT_decl_line   : 118	
    <8d2>   DW_AT_type        : <0x7ba>	
 <1><8d6>: Abbrev Number: 5 (DW_TAG_structure_type)
    <8d7>   DW_AT_name        : (indirect string, offset: 0x210): ListHead	
    <8db>   DW_AT_byte_size   : 8	
    <8dc>   DW_AT_decl_file   : 5	
    <8dd>   DW_AT_decl_line   : 6	
    <8de>   DW_AT_sibling     : <0x8ff>	
 <2><8e2>: Abbrev Number: 7 (DW_TAG_member)
    <8e3>   DW_AT_name        : (indirect string, offset: 0x219): prev	
    <8e7>   DW_AT_decl_file   : 5	
    <8e8>   DW_AT_decl_line   : 7	
    <8e9>   DW_AT_type        : <0x8ff>	
    <8ed>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><8f0>: Abbrev Number: 7 (DW_TAG_member)
    <8f1>   DW_AT_name        : (indirect string, offset: 0x21e): next	
    <8f5>   DW_AT_decl_file   : 5	
    <8f6>   DW_AT_decl_line   : 7	
    <8f7>   DW_AT_type        : <0x8ff>	
    <8fb>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <1><8ff>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <900>   DW_AT_byte_size   : 4	
    <901>   DW_AT_type        : <0x8d6>	
 <1><905>: Abbrev Number: 2 (DW_TAG_typedef)
    <906>   DW_AT_name        : (indirect string, offset: 0x210): ListHead	
    <90a>   DW_AT_decl_file   : 5	
    <90b>   DW_AT_decl_line   : 9	
    <90c>   DW_AT_type        : <0x8d6>	
 <1><910>: Abbrev Number: 9 (DW_TAG_structure_type)
    <911>   DW_AT_name        : PCB	
    <915>   DW_AT_byte_size   : 4108	
    <917>   DW_AT_decl_file   : 6	
    <918>   DW_AT_decl_line   : 4	
    <919>   DW_AT_sibling     : <0x948>	
 <2><91d>: Abbrev Number: 6 (DW_TAG_member)
    <91e>   DW_AT_name        : tf	
    <921>   DW_AT_decl_file   : 6	
    <922>   DW_AT_decl_line   : 5	
    <923>   DW_AT_type        : <0x948>	
    <927>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><92a>: Abbrev Number: 7 (DW_TAG_member)
    <92b>   DW_AT_name        : (indirect string, offset: 0x1e6): kstack	
    <92f>   DW_AT_decl_file   : 6	
    <930>   DW_AT_decl_line   : 6	
    <931>   DW_AT_type        : <0x94a>	
    <935>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><938>: Abbrev Number: 7 (DW_TAG_member)
    <939>   DW_AT_name        : (indirect string, offset: 0x1f7): list	
    <93d>   DW_AT_decl_file   : 6	
    <93e>   DW_AT_decl_line   : 7	
    <93f>   DW_AT_type        : <0x905>	
    <943>   DW_AT_data_member_location: 3 byte block: 23 84 20 	(DW_OP_plus_uconst: 4100)
 <1><948>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <949>   DW_AT_byte_size   : 4	
 <1><94a>: Abbrev Number: 11 (DW_TAG_array_type)
    <94b>   DW_AT_type        : <0x7a1>	
    <94f>   DW_AT_sibling     : <0x95b>	
 <2><953>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <954>   DW_AT_type        : <0x77a>	
    <958>   DW_AT_upper_bound : 4095	
 <1><95b>: Abbrev Number: 13 (DW_TAG_typedef)
    <95c>   DW_AT_name        : PCB	
    <960>   DW_AT_decl_file   : 6	
    <961>   DW_AT_decl_line   : 8	
    <962>   DW_AT_type        : <0x910>	
 <1><966>: Abbrev Number: 5 (DW_TAG_structure_type)
    <967>   DW_AT_name        : (indirect string, offset: 0x1bc): IRQ_t	
    <96b>   DW_AT_byte_size   : 8	
    <96c>   DW_AT_decl_file   : 1	
    <96d>   DW_AT_decl_line   : 17	
    <96e>   DW_AT_sibling     : <0x98f>	
 <2><972>: Abbrev Number: 7 (DW_TAG_member)
    <973>   DW_AT_name        : (indirect string, offset: 0x1a3): routine	
    <977>   DW_AT_decl_file   : 1	
    <978>   DW_AT_decl_line   : 18	
    <979>   DW_AT_type        : <0x991>	
    <97d>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><980>: Abbrev Number: 7 (DW_TAG_member)
    <981>   DW_AT_name        : (indirect string, offset: 0x21e): next	
    <985>   DW_AT_decl_file   : 1	
    <986>   DW_AT_decl_line   : 19	
    <987>   DW_AT_type        : <0x997>	
    <98b>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <1><98f>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <990>   DW_AT_prototyped  : 1	
 <1><991>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <992>   DW_AT_byte_size   : 4	
    <993>   DW_AT_type        : <0x98f>	
 <1><997>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <998>   DW_AT_byte_size   : 4	
    <999>   DW_AT_type        : <0x966>	
 <1><99d>: Abbrev Number: 15 (DW_TAG_subprogram)
    <99e>   DW_AT_name        : cli	
    <9a2>   DW_AT_decl_file   : 2	
    <9a3>   DW_AT_decl_line   : 101	
    <9a4>   DW_AT_prototyped  : 1	
    <9a5>   DW_AT_inline      : 3	(declared as inline and inlined)
 <1><9a6>: Abbrev Number: 16 (DW_TAG_subprogram)
    <9a7>   DW_AT_name        : (indirect string, offset: 0x1ed): wait_intr	
    <9ab>   DW_AT_decl_file   : 2	
    <9ac>   DW_AT_decl_line   : 107	
    <9ad>   DW_AT_inline      : 3	(declared as inline and inlined)
 <1><9ae>: Abbrev Number: 17 (DW_TAG_subprogram)
    <9af>   DW_AT_external    : 1	
    <9b0>   DW_AT_name        : (indirect string, offset: 0x1cf): add_irq_handle	
    <9b4>   DW_AT_decl_file   : 1	
    <9b5>   DW_AT_decl_line   : 27	
    <9b6>   DW_AT_prototyped  : 1	
    <9b7>   DW_AT_low_pc      : 0xc0100370	
    <9bb>   DW_AT_high_pc     : 0xc010044b	
    <9bf>   DW_AT_frame_base  : 0x605	(location list)
    <9c3>   DW_AT_sibling     : <0xa3f>	
 <2><9c7>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <9c8>   DW_AT_name        : irq	
    <9cc>   DW_AT_decl_file   : 1	
    <9cd>   DW_AT_decl_line   : 27	
    <9ce>   DW_AT_type        : <0x78c>	
    <9d2>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <2><9d5>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <9d6>   DW_AT_name        : (indirect string, offset: 0x1ab): func	
    <9da>   DW_AT_decl_file   : 1	
    <9db>   DW_AT_decl_line   : 27	
    <9dc>   DW_AT_type        : <0x991>	
    <9e0>   DW_AT_location    : 2 byte block: 91 4 	(DW_OP_fbreg: 4)
 <2><9e3>: Abbrev Number: 20 (DW_TAG_variable)
    <9e4>   DW_AT_name        : ptr	
    <9e8>   DW_AT_decl_file   : 1	
    <9e9>   DW_AT_decl_line   : 28	
    <9ea>   DW_AT_type        : <0x997>	
    <9ee>   DW_AT_location    : 0x649	(location list)
 <2><9f2>: Abbrev Number: 21 (DW_TAG_variable)
    <9f3>   DW_AT_name        : (indirect string, offset: 0x1c2): __FUNCTION__	
    <9f7>   DW_AT_type        : <0xa4f>	
    <9fb>   DW_AT_artificial  : 1	
    <9fc>   DW_AT_location    : 5 byte block: 3 b4 14 10 c0 	(DW_OP_addr: c01014b4)
 <2><a02>: Abbrev Number: 22 (DW_TAG_inlined_subroutine)
    <a03>   DW_AT_abstract_origin: <0x99d>	
    <a07>   DW_AT_low_pc      : 0xc01003be	
    <a0b>   DW_AT_high_pc     : 0xc01003bf	
    <a0f>   DW_AT_call_file   : 1	
    <a10>   DW_AT_call_line   : 29	
 <2><a11>: Abbrev Number: 22 (DW_TAG_inlined_subroutine)
    <a12>   DW_AT_abstract_origin: <0x9a6>	
    <a16>   DW_AT_low_pc      : 0xc0100410	
    <a1a>   DW_AT_high_pc     : 0xc0100413	
    <a1e>   DW_AT_call_file   : 1	
    <a1f>   DW_AT_call_line   : 29	
 <2><a20>: Abbrev Number: 22 (DW_TAG_inlined_subroutine)
    <a21>   DW_AT_abstract_origin: <0x99d>	
    <a25>   DW_AT_low_pc      : 0xc0100413	
    <a29>   DW_AT_high_pc     : 0xc0100414	
    <a2d>   DW_AT_call_file   : 1	
    <a2e>   DW_AT_call_line   : 31	
 <2><a2f>: Abbrev Number: 22 (DW_TAG_inlined_subroutine)
    <a30>   DW_AT_abstract_origin: <0x9a6>	
    <a34>   DW_AT_low_pc      : 0xc0100448	
    <a38>   DW_AT_high_pc     : 0xc010044b	
    <a3c>   DW_AT_call_file   : 1	
    <a3d>   DW_AT_call_line   : 31	
 <1><a3f>: Abbrev Number: 11 (DW_TAG_array_type)
    <a40>   DW_AT_type        : <0x7b3>	
    <a44>   DW_AT_sibling     : <0xa4f>	
 <2><a48>: Abbrev Number: 23 (DW_TAG_subrange_type)
    <a49>   DW_AT_type        : <0x77a>	
    <a4d>   DW_AT_upper_bound : 14	
 <1><a4f>: Abbrev Number: 24 (DW_TAG_const_type)
    <a50>   DW_AT_type        : <0xa3f>	
 <1><a54>: Abbrev Number: 17 (DW_TAG_subprogram)
    <a55>   DW_AT_external    : 1	
    <a56>   DW_AT_name        : (indirect string, offset: 0x1d3): irq_handle	
    <a5a>   DW_AT_decl_file   : 1	
    <a5b>   DW_AT_decl_line   : 40	
    <a5c>   DW_AT_prototyped  : 1	
    <a5d>   DW_AT_low_pc      : 0xc0100450	
    <a61>   DW_AT_high_pc     : 0xc0100583	
    <a65>   DW_AT_frame_base  : 0x65c	(location list)
    <a69>   DW_AT_sibling     : <0xb35>	
 <2><a6d>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <a6e>   DW_AT_name        : tf	
    <a71>   DW_AT_decl_file   : 1	
    <a72>   DW_AT_decl_line   : 40	
    <a73>   DW_AT_type        : <0xb35>	
    <a77>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <2><a7a>: Abbrev Number: 20 (DW_TAG_variable)
    <a7b>   DW_AT_name        : irq	
    <a7f>   DW_AT_decl_file   : 1	
    <a80>   DW_AT_decl_line   : 41	
    <a81>   DW_AT_type        : <0x78c>	
    <a85>   DW_AT_location    : 0x6a0	(location list)
 <2><a89>: Abbrev Number: 21 (DW_TAG_variable)
    <a8a>   DW_AT_name        : (indirect string, offset: 0x1c2): __FUNCTION__	
    <a8e>   DW_AT_type        : <0xb4b>	
    <a92>   DW_AT_artificial  : 1	
    <a93>   DW_AT_location    : 5 byte block: 3 c3 14 10 c0 	(DW_OP_addr: c01014c3)
 <2><a99>: Abbrev Number: 25 (DW_TAG_lexical_block)
    <a9a>   DW_AT_ranges      : 0xd0	
    <a9e>   DW_AT_sibling     : <0xadd>	
 <3><aa2>: Abbrev Number: 26 (DW_TAG_variable)
    <aa3>   DW_AT_name        : (indirect string, offset: 0x209): irq_id	
    <aa7>   DW_AT_decl_file   : 1	
    <aa8>   DW_AT_decl_line   : 55	
    <aa9>   DW_AT_type        : <0x78c>	
    <aad>   DW_AT_location    : 0x6df	(location list)
 <3><ab1>: Abbrev Number: 20 (DW_TAG_variable)
    <ab2>   DW_AT_name        : f	
    <ab4>   DW_AT_decl_file   : 1	
    <ab5>   DW_AT_decl_line   : 57	
    <ab6>   DW_AT_type        : <0x997>	
    <aba>   DW_AT_location    : 0x6fd	(location list)
 <3><abe>: Abbrev Number: 22 (DW_TAG_inlined_subroutine)
    <abf>   DW_AT_abstract_origin: <0x99d>	
    <ac3>   DW_AT_low_pc      : 0xc010052b	
    <ac7>   DW_AT_high_pc     : 0xc010052c	
    <acb>   DW_AT_call_file   : 1	
    <acc>   DW_AT_call_line   : 56	
 <3><acd>: Abbrev Number: 22 (DW_TAG_inlined_subroutine)
    <ace>   DW_AT_abstract_origin: <0x9a6>	
    <ad2>   DW_AT_low_pc      : 0xc0100580	
    <ad6>   DW_AT_high_pc     : 0xc0100583	
    <ada>   DW_AT_call_file   : 1	
    <adb>   DW_AT_call_line   : 56	
 <2><add>: Abbrev Number: 27 (DW_TAG_lexical_block)
    <ade>   DW_AT_low_pc      : 0xc01004ab	
    <ae2>   DW_AT_high_pc     : 0xc01004f3	
    <ae6>   DW_AT_sibling     : <0xb16>	
 <3><aea>: Abbrev Number: 28 (DW_TAG_variable)
    <aeb>   DW_AT_name        : (indirect string, offset: 0x103): logo	
    <aef>   DW_AT_decl_file   : 1	
    <af0>   DW_AT_decl_line   : 50	
    <af1>   DW_AT_type        : <0xb50>	
    <af5>   DW_AT_external    : 1	
    <af6>   DW_AT_declaration : 1	
 <3><af7>: Abbrev Number: 22 (DW_TAG_inlined_subroutine)
    <af8>   DW_AT_abstract_origin: <0x99d>	
    <afc>   DW_AT_low_pc      : 0xc01004ab	
    <b00>   DW_AT_high_pc     : 0xc01004ac	
    <b04>   DW_AT_call_file   : 1	
    <b05>   DW_AT_call_line   : 51	
 <3><b06>: Abbrev Number: 22 (DW_TAG_inlined_subroutine)
    <b07>   DW_AT_abstract_origin: <0x9a6>	
    <b0b>   DW_AT_low_pc      : 0xc01004f0	
    <b0f>   DW_AT_high_pc     : 0xc01004f3	
    <b13>   DW_AT_call_file   : 1	
    <b14>   DW_AT_call_line   : 51	
 <2><b16>: Abbrev Number: 22 (DW_TAG_inlined_subroutine)
    <b17>   DW_AT_abstract_origin: <0x99d>	
    <b1b>   DW_AT_low_pc      : 0xc01004f3	
    <b1f>   DW_AT_high_pc     : 0xc01004f4	
    <b23>   DW_AT_call_file   : 1	
    <b24>   DW_AT_call_line   : 44	
 <2><b25>: Abbrev Number: 22 (DW_TAG_inlined_subroutine)
    <b26>   DW_AT_abstract_origin: <0x9a6>	
    <b2a>   DW_AT_low_pc      : 0xc0100528	
    <b2e>   DW_AT_high_pc     : 0xc010052b	
    <b32>   DW_AT_call_file   : 1	
    <b33>   DW_AT_call_line   : 44	
 <1><b35>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <b36>   DW_AT_byte_size   : 4	
    <b37>   DW_AT_type        : <0x8cb>	
 <1><b3b>: Abbrev Number: 11 (DW_TAG_array_type)
    <b3c>   DW_AT_type        : <0x7b3>	
    <b40>   DW_AT_sibling     : <0xb4b>	
 <2><b44>: Abbrev Number: 23 (DW_TAG_subrange_type)
    <b45>   DW_AT_type        : <0x77a>	
    <b49>   DW_AT_upper_bound : 10	
 <1><b4b>: Abbrev Number: 24 (DW_TAG_const_type)
    <b4c>   DW_AT_type        : <0xb3b>	
 <1><b50>: Abbrev Number: 11 (DW_TAG_array_type)
    <b51>   DW_AT_type        : <0x7a1>	
    <b55>   DW_AT_sibling     : <0xb5b>	
 <2><b59>: Abbrev Number: 29 (DW_TAG_subrange_type)
 <1><b5b>: Abbrev Number: 30 (DW_TAG_variable)
    <b5c>   DW_AT_name        : (indirect string, offset: 0x4a): dummy	
    <b60>   DW_AT_decl_file   : 7	
    <b61>   DW_AT_decl_line   : 8	
    <b62>   DW_AT_type        : <0xb6c>	
    <b66>   DW_AT_location    : 5 byte block: 3 40 30 10 c0 	(DW_OP_addr: c0103040)
 <1><b6c>: Abbrev Number: 31 (DW_TAG_volatile_type)
    <b6d>   DW_AT_type        : <0x78c>	
 <1><b71>: Abbrev Number: 11 (DW_TAG_array_type)
    <b72>   DW_AT_type        : <0x966>	
    <b76>   DW_AT_sibling     : <0xb81>	
 <2><b7a>: Abbrev Number: 23 (DW_TAG_subrange_type)
    <b7b>   DW_AT_type        : <0x77a>	
    <b7f>   DW_AT_upper_bound : 31	
 <1><b81>: Abbrev Number: 30 (DW_TAG_variable)
    <b82>   DW_AT_name        : (indirect string, offset: 0x1b0): handle_pool	
    <b86>   DW_AT_decl_file   : 1	
    <b87>   DW_AT_decl_line   : 22	
    <b88>   DW_AT_type        : <0xb71>	
    <b8c>   DW_AT_location    : 5 byte block: 3 60 30 10 c0 	(DW_OP_addr: c0103060)
 <1><b92>: Abbrev Number: 11 (DW_TAG_array_type)
    <b93>   DW_AT_type        : <0x997>	
    <b97>   DW_AT_sibling     : <0xba2>	
 <2><b9b>: Abbrev Number: 23 (DW_TAG_subrange_type)
    <b9c>   DW_AT_type        : <0x77a>	
    <ba0>   DW_AT_upper_bound : 15	
 <1><ba2>: Abbrev Number: 30 (DW_TAG_variable)
    <ba3>   DW_AT_name        : (indirect string, offset: 0x190): handles	
    <ba7>   DW_AT_decl_file   : 1	
    <ba8>   DW_AT_decl_line   : 23	
    <ba9>   DW_AT_type        : <0xb92>	
    <bad>   DW_AT_location    : 5 byte block: 3 60 31 10 c0 	(DW_OP_addr: c0103160)
 <1><bb3>: Abbrev Number: 30 (DW_TAG_variable)
    <bb4>   DW_AT_name        : (indirect string, offset: 0x1fc): handle_count	
    <bb8>   DW_AT_decl_file   : 1	
    <bb9>   DW_AT_decl_line   : 24	
    <bba>   DW_AT_type        : <0x78c>	
    <bbe>   DW_AT_location    : 5 byte block: 3 44 30 10 c0 	(DW_OP_addr: c0103044)
 <1><bc4>: Abbrev Number: 28 (DW_TAG_variable)
    <bc5>   DW_AT_name        : (indirect string, offset: 0x1de): current	
    <bc9>   DW_AT_decl_file   : 6	
    <bca>   DW_AT_decl_line   : 9	
    <bcb>   DW_AT_type        : <0xbd1>	
    <bcf>   DW_AT_external    : 1	
    <bd0>   DW_AT_declaration : 1	
 <1><bd1>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <bd2>   DW_AT_byte_size   : 4	
    <bd3>   DW_AT_type        : <0x95b>	
 <1><bd7>: Abbrev Number: 28 (DW_TAG_variable)
    <bd8>   DW_AT_name        : (indirect string, offset: 0x103): logo	
    <bdc>   DW_AT_decl_file   : 1	
    <bdd>   DW_AT_decl_line   : 50	
    <bde>   DW_AT_type        : <0xb50>	
    <be2>   DW_AT_external    : 1	
    <be3>   DW_AT_declaration : 1	
  Compilation Unit @ offset 0xbe5:
   Length:        0x624 (32-bit)
   Version:       2
   Abbrev Offset: 1449
   Pointer Size:  4
 <0><bf0>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <bf1>   DW_AT_producer    : (indirect string, offset: 0x81): GNU C 4.6.3	
    <bf5>   DW_AT_language    : 1	(ANSI C)
    <bf6>   DW_AT_name        : (indirect string, offset: 0x29b): src/kernel/irq/idt.c	
    <bfa>   DW_AT_comp_dir    : (indirect string, offset: 0x13): /home/lin/code/cslab/os-lab1	
    <bfe>   DW_AT_low_pc      : 0xc0100590	
    <c02>   DW_AT_high_pc     : 0xc010094a	
    <c06>   DW_AT_stmt_list   : 0x3bb	
 <1><c0a>: Abbrev Number: 2 (DW_TAG_typedef)
    <c0b>   DW_AT_name        : (indirect string, offset: 0x78): uint32_t	
    <c0f>   DW_AT_decl_file   : 3	
    <c10>   DW_AT_decl_line   : 7	
    <c11>   DW_AT_type        : <0xc15>	
 <1><c15>: Abbrev Number: 3 (DW_TAG_base_type)
    <c16>   DW_AT_byte_size   : 4	
    <c17>   DW_AT_encoding    : 7	(unsigned)
    <c18>   DW_AT_name        : (indirect string, offset: 0x6): unsigned int	
 <1><c1c>: Abbrev Number: 4 (DW_TAG_base_type)
    <c1d>   DW_AT_byte_size   : 4	
    <c1e>   DW_AT_encoding    : 5	(signed)
    <c1f>   DW_AT_name        : int	
 <1><c23>: Abbrev Number: 2 (DW_TAG_typedef)
    <c24>   DW_AT_name        : (indirect string, offset: 0x152): uint16_t	
    <c28>   DW_AT_decl_file   : 3	
    <c29>   DW_AT_decl_line   : 9	
    <c2a>   DW_AT_type        : <0xc2e>	
 <1><c2e>: Abbrev Number: 3 (DW_TAG_base_type)
    <c2f>   DW_AT_byte_size   : 2	
    <c30>   DW_AT_encoding    : 7	(unsigned)
    <c31>   DW_AT_name        : (indirect string, offset: 0x0): short unsigned int	
 <1><c35>: Abbrev Number: 3 (DW_TAG_base_type)
    <c36>   DW_AT_byte_size   : 2	
    <c37>   DW_AT_encoding    : 5	(signed)
    <c38>   DW_AT_name        : (indirect string, offset: 0x9f): short int	
 <1><c3c>: Abbrev Number: 3 (DW_TAG_base_type)
    <c3d>   DW_AT_byte_size   : 1	
    <c3e>   DW_AT_encoding    : 8	(unsigned char)
    <c3f>   DW_AT_name        : (indirect string, offset: 0x6a): unsigned char	
 <1><c43>: Abbrev Number: 3 (DW_TAG_base_type)
    <c44>   DW_AT_byte_size   : 1	
    <c45>   DW_AT_encoding    : 6	(signed char)
    <c46>   DW_AT_name        : (indirect string, offset: 0x73): char	
 <1><c4a>: Abbrev Number: 5 (DW_TAG_structure_type)
    <c4b>   DW_AT_name        : (indirect string, offset: 0x28c): GateDescriptor	
    <c4f>   DW_AT_byte_size   : 8	
    <c50>   DW_AT_decl_file   : 4	
    <c51>   DW_AT_decl_line   : 100	
    <c52>   DW_AT_sibling     : <0xcdf>	
 <2><c56>: Abbrev Number: 6 (DW_TAG_member)
    <c57>   DW_AT_name        : (indirect string, offset: 0x223): offset_15_0	
    <c5b>   DW_AT_decl_file   : 4	
    <c5c>   DW_AT_decl_line   : 101	
    <c5d>   DW_AT_type        : <0xc0a>	
    <c61>   DW_AT_byte_size   : 4	
    <c62>   DW_AT_bit_size    : 16	
    <c63>   DW_AT_bit_offset  : 16	
    <c64>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><c67>: Abbrev Number: 6 (DW_TAG_member)
    <c68>   DW_AT_name        : (indirect string, offset: 0x53a): segment	
    <c6c>   DW_AT_decl_file   : 4	
    <c6d>   DW_AT_decl_line   : 102	
    <c6e>   DW_AT_type        : <0xc0a>	
    <c72>   DW_AT_byte_size   : 4	
    <c73>   DW_AT_bit_size    : 16	
    <c74>   DW_AT_bit_offset  : 0	
    <c75>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><c78>: Abbrev Number: 6 (DW_TAG_member)
    <c79>   DW_AT_name        : (indirect string, offset: 0x23f): pad0	
    <c7d>   DW_AT_decl_file   : 4	
    <c7e>   DW_AT_decl_line   : 103	
    <c7f>   DW_AT_type        : <0xc0a>	
    <c83>   DW_AT_byte_size   : 4	
    <c84>   DW_AT_bit_size    : 8	
    <c85>   DW_AT_bit_offset  : 24	
    <c86>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><c89>: Abbrev Number: 6 (DW_TAG_member)
    <c8a>   DW_AT_name        : (indirect string, offset: 0x54c): type	
    <c8e>   DW_AT_decl_file   : 4	
    <c8f>   DW_AT_decl_line   : 104	
    <c90>   DW_AT_type        : <0xc0a>	
    <c94>   DW_AT_byte_size   : 4	
    <c95>   DW_AT_bit_size    : 4	
    <c96>   DW_AT_bit_offset  : 20	
    <c97>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><c9a>: Abbrev Number: 6 (DW_TAG_member)
    <c9b>   DW_AT_name        : (indirect string, offset: 0x285): system	
    <c9f>   DW_AT_decl_file   : 4	
    <ca0>   DW_AT_decl_line   : 105	
    <ca1>   DW_AT_type        : <0xc0a>	
    <ca5>   DW_AT_byte_size   : 4	
    <ca6>   DW_AT_bit_size    : 1	
    <ca7>   DW_AT_bit_offset  : 19	
    <ca8>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><cab>: Abbrev Number: 6 (DW_TAG_member)
    <cac>   DW_AT_name        : (indirect string, offset: 0x2b8): privilege_level	
    <cb0>   DW_AT_decl_file   : 4	
    <cb1>   DW_AT_decl_line   : 106	
    <cb2>   DW_AT_type        : <0xc0a>	
    <cb6>   DW_AT_byte_size   : 4	
    <cb7>   DW_AT_bit_size    : 2	
    <cb8>   DW_AT_bit_offset  : 17	
    <cb9>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><cbc>: Abbrev Number: 6 (DW_TAG_member)
    <cbd>   DW_AT_name        : (indirect string, offset: 0x2b0): present	
    <cc1>   DW_AT_decl_file   : 4	
    <cc2>   DW_AT_decl_line   : 107	
    <cc3>   DW_AT_type        : <0xc0a>	
    <cc7>   DW_AT_byte_size   : 4	
    <cc8>   DW_AT_bit_size    : 1	
    <cc9>   DW_AT_bit_offset  : 16	
    <cca>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><ccd>: Abbrev Number: 6 (DW_TAG_member)
    <cce>   DW_AT_name        : (indirect string, offset: 0x26f): offset_31_16	
    <cd2>   DW_AT_decl_file   : 4	
    <cd3>   DW_AT_decl_line   : 108	
    <cd4>   DW_AT_type        : <0xc0a>	
    <cd8>   DW_AT_byte_size   : 4	
    <cd9>   DW_AT_bit_size    : 16	
    <cda>   DW_AT_bit_offset  : 0	
    <cdb>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <1><cdf>: Abbrev Number: 2 (DW_TAG_typedef)
    <ce0>   DW_AT_name        : (indirect string, offset: 0x244): GateDesc	
    <ce4>   DW_AT_decl_file   : 4	
    <ce5>   DW_AT_decl_line   : 109	
    <ce6>   DW_AT_type        : <0xc4a>	
 <1><cea>: Abbrev Number: 7 (DW_TAG_subprogram)
    <ceb>   DW_AT_name        : (indirect string, offset: 0x27c): set_trap	
    <cef>   DW_AT_decl_file   : 1	
    <cf0>   DW_AT_decl_line   : 24	
    <cf1>   DW_AT_prototyped  : 1	
    <cf2>   DW_AT_inline      : 1	(inlined)
    <cf3>   DW_AT_sibling     : <0xd24>	
 <2><cf7>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <cf8>   DW_AT_name        : ptr	
    <cfc>   DW_AT_decl_file   : 1	
    <cfd>   DW_AT_decl_line   : 24	
    <cfe>   DW_AT_type        : <0xd24>	
 <2><d02>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <d03>   DW_AT_name        : (indirect string, offset: 0x25d): selector	
    <d07>   DW_AT_decl_file   : 1	
    <d08>   DW_AT_decl_line   : 24	
    <d09>   DW_AT_type        : <0xc0a>	
 <2><d0d>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <d0e>   DW_AT_name        : (indirect string, offset: 0x24d): offset	
    <d12>   DW_AT_decl_file   : 1	
    <d13>   DW_AT_decl_line   : 24	
    <d14>   DW_AT_type        : <0xc0a>	
 <2><d18>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <d19>   DW_AT_name        : dpl	
    <d1d>   DW_AT_decl_file   : 1	
    <d1e>   DW_AT_decl_line   : 24	
    <d1f>   DW_AT_type        : <0xc0a>	
 <1><d24>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <d25>   DW_AT_byte_size   : 4	
    <d26>   DW_AT_type        : <0xcdf>	
 <1><d2a>: Abbrev Number: 7 (DW_TAG_subprogram)
    <d2b>   DW_AT_name        : (indirect string, offset: 0x254): set_intr	
    <d2f>   DW_AT_decl_file   : 1	
    <d30>   DW_AT_decl_line   : 12	
    <d31>   DW_AT_prototyped  : 1	
    <d32>   DW_AT_inline      : 1	(inlined)
    <d33>   DW_AT_sibling     : <0xd64>	
 <2><d37>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <d38>   DW_AT_name        : ptr	
    <d3c>   DW_AT_decl_file   : 1	
    <d3d>   DW_AT_decl_line   : 12	
    <d3e>   DW_AT_type        : <0xd24>	
 <2><d42>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <d43>   DW_AT_name        : (indirect string, offset: 0x25d): selector	
    <d47>   DW_AT_decl_file   : 1	
    <d48>   DW_AT_decl_line   : 12	
    <d49>   DW_AT_type        : <0xc0a>	
 <2><d4d>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <d4e>   DW_AT_name        : (indirect string, offset: 0x24d): offset	
    <d52>   DW_AT_decl_file   : 1	
    <d53>   DW_AT_decl_line   : 12	
    <d54>   DW_AT_type        : <0xc0a>	
 <2><d58>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <d59>   DW_AT_name        : dpl	
    <d5d>   DW_AT_decl_file   : 1	
    <d5e>   DW_AT_decl_line   : 12	
    <d5f>   DW_AT_type        : <0xc0a>	
 <1><d64>: Abbrev Number: 7 (DW_TAG_subprogram)
    <d65>   DW_AT_name        : (indirect string, offset: 0x234): write_idtr	
    <d69>   DW_AT_decl_file   : 2	
    <d6a>   DW_AT_decl_line   : 71	
    <d6b>   DW_AT_prototyped  : 1	
    <d6c>   DW_AT_inline      : 3	(declared as inline and inlined)
    <d6d>   DW_AT_sibling     : <0xd93>	
 <2><d71>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <d72>   DW_AT_name        : (indirect string, offset: 0x22f): addr	
    <d76>   DW_AT_decl_file   : 2	
    <d77>   DW_AT_decl_line   : 71	
    <d78>   DW_AT_type        : <0xd93>	
 <2><d7c>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <d7d>   DW_AT_name        : (indirect string, offset: 0x4a7): size	
    <d81>   DW_AT_decl_file   : 2	
    <d82>   DW_AT_decl_line   : 71	
    <d83>   DW_AT_type        : <0xc0a>	
 <2><d87>: Abbrev Number: 11 (DW_TAG_variable)
    <d88>   DW_AT_name        : (indirect string, offset: 0xc1): data	
    <d8c>   DW_AT_decl_file   : 2	
    <d8d>   DW_AT_decl_line   : 72	
    <d8e>   DW_AT_type        : <0xda5>	
 <1><d93>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <d94>   DW_AT_byte_size   : 4	
 <1><d95>: Abbrev Number: 13 (DW_TAG_array_type)
    <d96>   DW_AT_type        : <0xc23>	
    <d9a>   DW_AT_sibling     : <0xda5>	
 <2><d9e>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <d9f>   DW_AT_type        : <0xc15>	
    <da3>   DW_AT_upper_bound : 2	
 <1><da5>: Abbrev Number: 15 (DW_TAG_volatile_type)
    <da6>   DW_AT_type        : <0xd95>	
 <1><daa>: Abbrev Number: 16 (DW_TAG_subprogram)
    <dab>   DW_AT_external    : 1	
    <dac>   DW_AT_name        : (indirect string, offset: 0x266): init_idt	
    <db0>   DW_AT_decl_file   : 1	
    <db1>   DW_AT_decl_line   : 57	
    <db2>   DW_AT_low_pc      : 0xc0100590	
    <db6>   DW_AT_high_pc     : 0xc010094a	
    <dba>   DW_AT_frame_base  : 0x710	(location list)
    <dbe>   DW_AT_sibling     : <0x11d5>	
 <2><dc2>: Abbrev Number: 17 (DW_TAG_variable)
    <dc3>   DW_AT_name        : i	
    <dc5>   DW_AT_decl_file   : 1	
    <dc6>   DW_AT_decl_line   : 58	
    <dc7>   DW_AT_type        : <0xc1c>	
    <dcb>   DW_AT_location    : 0x748	(location list)
 <2><dcf>: Abbrev Number: 18 (DW_TAG_inlined_subroutine)
    <dd0>   DW_AT_abstract_origin: <0xcea>	
    <dd4>   DW_AT_entry_pc    : 0xc01005a7	
    <dd8>   DW_AT_ranges      : 0xe8	
    <ddc>   DW_AT_call_file   : 1	
    <ddd>   DW_AT_call_line   : 60	
    <dde>   DW_AT_sibling     : <0xdfd>	
 <3><de2>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <de3>   DW_AT_abstract_origin: <0xd18>	
    <de7>   DW_AT_const_value : 0	
 <3><de8>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <de9>   DW_AT_abstract_origin: <0xd0d>	
 <3><ded>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <dee>   DW_AT_abstract_origin: <0xd02>	
    <df2>   DW_AT_const_value : 8	
 <3><df3>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <df4>   DW_AT_abstract_origin: <0xcf7>	
    <df8>   DW_AT_location    : 0x767	(location list)
 <2><dfd>: Abbrev Number: 18 (DW_TAG_inlined_subroutine)
    <dfe>   DW_AT_abstract_origin: <0xcea>	
    <e02>   DW_AT_entry_pc    : 0xc01005d0	
    <e06>   DW_AT_ranges      : 0x100	
    <e0a>   DW_AT_call_file   : 1	
    <e0b>   DW_AT_call_line   : 62	
    <e0c>   DW_AT_sibling     : <0xe2e>	
 <3><e10>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <e11>   DW_AT_abstract_origin: <0xd18>	
    <e15>   DW_AT_const_value : 0	
 <3><e16>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <e17>   DW_AT_abstract_origin: <0xd0d>	
 <3><e1b>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <e1c>   DW_AT_abstract_origin: <0xd02>	
    <e20>   DW_AT_const_value : 8	
 <3><e21>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <e22>   DW_AT_abstract_origin: <0xcf7>	
    <e26>   DW_AT_location    : 6 byte block: 3 c0 31 10 c0 9f 	(DW_OP_addr: c01031c0; DW_OP_stack_value)
 <2><e2e>: Abbrev Number: 18 (DW_TAG_inlined_subroutine)
    <e2f>   DW_AT_abstract_origin: <0xcea>	
    <e33>   DW_AT_entry_pc    : 0xc01005eb	
    <e37>   DW_AT_ranges      : 0x118	
    <e3b>   DW_AT_call_file   : 1	
    <e3c>   DW_AT_call_line   : 63	
    <e3d>   DW_AT_sibling     : <0xe5f>	
 <3><e41>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <e42>   DW_AT_abstract_origin: <0xd18>	
    <e46>   DW_AT_const_value : 0	
 <3><e47>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <e48>   DW_AT_abstract_origin: <0xd0d>	
 <3><e4c>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <e4d>   DW_AT_abstract_origin: <0xd02>	
    <e51>   DW_AT_const_value : 8	
 <3><e52>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <e53>   DW_AT_abstract_origin: <0xcf7>	
    <e57>   DW_AT_location    : 6 byte block: 3 c8 31 10 c0 9f 	(DW_OP_addr: c01031c8; DW_OP_stack_value)
 <2><e5f>: Abbrev Number: 18 (DW_TAG_inlined_subroutine)
    <e60>   DW_AT_abstract_origin: <0xcea>	
    <e64>   DW_AT_entry_pc    : 0xc0100601	
    <e68>   DW_AT_ranges      : 0x130	
    <e6c>   DW_AT_call_file   : 1	
    <e6d>   DW_AT_call_line   : 64	
    <e6e>   DW_AT_sibling     : <0xe90>	
 <3><e72>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <e73>   DW_AT_abstract_origin: <0xd18>	
    <e77>   DW_AT_const_value : 0	
 <3><e78>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <e79>   DW_AT_abstract_origin: <0xd0d>	
 <3><e7d>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <e7e>   DW_AT_abstract_origin: <0xd02>	
    <e82>   DW_AT_const_value : 8	
 <3><e83>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <e84>   DW_AT_abstract_origin: <0xcf7>	
    <e88>   DW_AT_location    : 6 byte block: 3 d0 31 10 c0 9f 	(DW_OP_addr: c01031d0; DW_OP_stack_value)
 <2><e90>: Abbrev Number: 18 (DW_TAG_inlined_subroutine)
    <e91>   DW_AT_abstract_origin: <0xcea>	
    <e95>   DW_AT_entry_pc    : 0xc0100617	
    <e99>   DW_AT_ranges      : 0x148	
    <e9d>   DW_AT_call_file   : 1	
    <e9e>   DW_AT_call_line   : 65	
    <e9f>   DW_AT_sibling     : <0xec1>	
 <3><ea3>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <ea4>   DW_AT_abstract_origin: <0xd18>	
    <ea8>   DW_AT_const_value : 0	
 <3><ea9>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <eaa>   DW_AT_abstract_origin: <0xd0d>	
 <3><eae>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <eaf>   DW_AT_abstract_origin: <0xd02>	
    <eb3>   DW_AT_const_value : 8	
 <3><eb4>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <eb5>   DW_AT_abstract_origin: <0xcf7>	
    <eb9>   DW_AT_location    : 6 byte block: 3 d8 31 10 c0 9f 	(DW_OP_addr: c01031d8; DW_OP_stack_value)
 <2><ec1>: Abbrev Number: 18 (DW_TAG_inlined_subroutine)
    <ec2>   DW_AT_abstract_origin: <0xcea>	
    <ec6>   DW_AT_entry_pc    : 0xc010062d	
    <eca>   DW_AT_ranges      : 0x160	
    <ece>   DW_AT_call_file   : 1	
    <ecf>   DW_AT_call_line   : 66	
    <ed0>   DW_AT_sibling     : <0xef2>	
 <3><ed4>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <ed5>   DW_AT_abstract_origin: <0xd18>	
    <ed9>   DW_AT_const_value : 0	
 <3><eda>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <edb>   DW_AT_abstract_origin: <0xd0d>	
 <3><edf>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <ee0>   DW_AT_abstract_origin: <0xd02>	
    <ee4>   DW_AT_const_value : 8	
 <3><ee5>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <ee6>   DW_AT_abstract_origin: <0xcf7>	
    <eea>   DW_AT_location    : 6 byte block: 3 e0 31 10 c0 9f 	(DW_OP_addr: c01031e0; DW_OP_stack_value)
 <2><ef2>: Abbrev Number: 18 (DW_TAG_inlined_subroutine)
    <ef3>   DW_AT_abstract_origin: <0xcea>	
    <ef7>   DW_AT_entry_pc    : 0xc0100643	
    <efb>   DW_AT_ranges      : 0x178	
    <eff>   DW_AT_call_file   : 1	
    <f00>   DW_AT_call_line   : 67	
    <f01>   DW_AT_sibling     : <0xf23>	
 <3><f05>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <f06>   DW_AT_abstract_origin: <0xd18>	
    <f0a>   DW_AT_const_value : 0	
 <3><f0b>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <f0c>   DW_AT_abstract_origin: <0xd0d>	
 <3><f10>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <f11>   DW_AT_abstract_origin: <0xd02>	
    <f15>   DW_AT_const_value : 8	
 <3><f16>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <f17>   DW_AT_abstract_origin: <0xcf7>	
    <f1b>   DW_AT_location    : 6 byte block: 3 e8 31 10 c0 9f 	(DW_OP_addr: c01031e8; DW_OP_stack_value)
 <2><f23>: Abbrev Number: 18 (DW_TAG_inlined_subroutine)
    <f24>   DW_AT_abstract_origin: <0xcea>	
    <f28>   DW_AT_entry_pc    : 0xc0100659	
    <f2c>   DW_AT_ranges      : 0x190	
    <f30>   DW_AT_call_file   : 1	
    <f31>   DW_AT_call_line   : 68	
    <f32>   DW_AT_sibling     : <0xf54>	
 <3><f36>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <f37>   DW_AT_abstract_origin: <0xd18>	
    <f3b>   DW_AT_const_value : 0	
 <3><f3c>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <f3d>   DW_AT_abstract_origin: <0xd0d>	
 <3><f41>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <f42>   DW_AT_abstract_origin: <0xd02>	
    <f46>   DW_AT_const_value : 8	
 <3><f47>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <f48>   DW_AT_abstract_origin: <0xcf7>	
    <f4c>   DW_AT_location    : 6 byte block: 3 f0 31 10 c0 9f 	(DW_OP_addr: c01031f0; DW_OP_stack_value)
 <2><f54>: Abbrev Number: 18 (DW_TAG_inlined_subroutine)
    <f55>   DW_AT_abstract_origin: <0xcea>	
    <f59>   DW_AT_entry_pc    : 0xc0100710	
    <f5d>   DW_AT_ranges      : 0x1a8	
    <f61>   DW_AT_call_file   : 1	
    <f62>   DW_AT_call_line   : 69	
    <f63>   DW_AT_sibling     : <0xf85>	
 <3><f67>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <f68>   DW_AT_abstract_origin: <0xd18>	
    <f6c>   DW_AT_const_value : 0	
 <3><f6d>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <f6e>   DW_AT_abstract_origin: <0xd0d>	
 <3><f72>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <f73>   DW_AT_abstract_origin: <0xd02>	
    <f77>   DW_AT_const_value : 8	
 <3><f78>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <f79>   DW_AT_abstract_origin: <0xcf7>	
    <f7d>   DW_AT_location    : 6 byte block: 3 f8 31 10 c0 9f 	(DW_OP_addr: c01031f8; DW_OP_stack_value)
 <2><f85>: Abbrev Number: 18 (DW_TAG_inlined_subroutine)
    <f86>   DW_AT_abstract_origin: <0xcea>	
    <f8a>   DW_AT_entry_pc    : 0xc0100726	
    <f8e>   DW_AT_ranges      : 0x1c0	
    <f92>   DW_AT_call_file   : 1	
    <f93>   DW_AT_call_line   : 70	
    <f94>   DW_AT_sibling     : <0xfb6>	
 <3><f98>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <f99>   DW_AT_abstract_origin: <0xd18>	
    <f9d>   DW_AT_const_value : 0	
 <3><f9e>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <f9f>   DW_AT_abstract_origin: <0xd0d>	
 <3><fa3>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <fa4>   DW_AT_abstract_origin: <0xd02>	
    <fa8>   DW_AT_const_value : 8	
 <3><fa9>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <faa>   DW_AT_abstract_origin: <0xcf7>	
    <fae>   DW_AT_location    : 6 byte block: 3 0 32 10 c0 9f 	(DW_OP_addr: c0103200; DW_OP_stack_value)
 <2><fb6>: Abbrev Number: 18 (DW_TAG_inlined_subroutine)
    <fb7>   DW_AT_abstract_origin: <0xcea>	
    <fbb>   DW_AT_entry_pc    : 0xc010073c	
    <fbf>   DW_AT_ranges      : 0x1d8	
    <fc3>   DW_AT_call_file   : 1	
    <fc4>   DW_AT_call_line   : 71	
    <fc5>   DW_AT_sibling     : <0xfe7>	
 <3><fc9>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <fca>   DW_AT_abstract_origin: <0xd18>	
    <fce>   DW_AT_const_value : 0	
 <3><fcf>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <fd0>   DW_AT_abstract_origin: <0xd0d>	
 <3><fd4>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <fd5>   DW_AT_abstract_origin: <0xd02>	
    <fd9>   DW_AT_const_value : 8	
 <3><fda>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <fdb>   DW_AT_abstract_origin: <0xcf7>	
    <fdf>   DW_AT_location    : 6 byte block: 3 8 32 10 c0 9f 	(DW_OP_addr: c0103208; DW_OP_stack_value)
 <2><fe7>: Abbrev Number: 18 (DW_TAG_inlined_subroutine)
    <fe8>   DW_AT_abstract_origin: <0xcea>	
    <fec>   DW_AT_entry_pc    : 0xc0100752	
    <ff0>   DW_AT_ranges      : 0x1f0	
    <ff4>   DW_AT_call_file   : 1	
    <ff5>   DW_AT_call_line   : 72	
    <ff6>   DW_AT_sibling     : <0x1018>	
 <3><ffa>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <ffb>   DW_AT_abstract_origin: <0xd18>	
    <fff>   DW_AT_const_value : 0	
 <3><1000>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <1001>   DW_AT_abstract_origin: <0xd0d>	
 <3><1005>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <1006>   DW_AT_abstract_origin: <0xd02>	
    <100a>   DW_AT_const_value : 8	
 <3><100b>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <100c>   DW_AT_abstract_origin: <0xcf7>	
    <1010>   DW_AT_location    : 6 byte block: 3 10 32 10 c0 9f 	(DW_OP_addr: c0103210; DW_OP_stack_value)
 <2><1018>: Abbrev Number: 18 (DW_TAG_inlined_subroutine)
    <1019>   DW_AT_abstract_origin: <0xcea>	
    <101d>   DW_AT_entry_pc    : 0xc0100768	
    <1021>   DW_AT_ranges      : 0x208	
    <1025>   DW_AT_call_file   : 1	
    <1026>   DW_AT_call_line   : 73	
    <1027>   DW_AT_sibling     : <0x1049>	
 <3><102b>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <102c>   DW_AT_abstract_origin: <0xd18>	
    <1030>   DW_AT_const_value : 0	
 <3><1031>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <1032>   DW_AT_abstract_origin: <0xd0d>	
 <3><1036>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <1037>   DW_AT_abstract_origin: <0xd02>	
    <103b>   DW_AT_const_value : 8	
 <3><103c>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <103d>   DW_AT_abstract_origin: <0xcf7>	
    <1041>   DW_AT_location    : 6 byte block: 3 18 32 10 c0 9f 	(DW_OP_addr: c0103218; DW_OP_stack_value)
 <2><1049>: Abbrev Number: 18 (DW_TAG_inlined_subroutine)
    <104a>   DW_AT_abstract_origin: <0xcea>	
    <104e>   DW_AT_entry_pc    : 0xc010077e	
    <1052>   DW_AT_ranges      : 0x220	
    <1056>   DW_AT_call_file   : 1	
    <1057>   DW_AT_call_line   : 74	
    <1058>   DW_AT_sibling     : <0x107a>	
 <3><105c>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <105d>   DW_AT_abstract_origin: <0xd18>	
    <1061>   DW_AT_const_value : 0	
 <3><1062>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <1063>   DW_AT_abstract_origin: <0xd0d>	
 <3><1067>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <1068>   DW_AT_abstract_origin: <0xd02>	
    <106c>   DW_AT_const_value : 8	
 <3><106d>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <106e>   DW_AT_abstract_origin: <0xcf7>	
    <1072>   DW_AT_location    : 6 byte block: 3 20 32 10 c0 9f 	(DW_OP_addr: c0103220; DW_OP_stack_value)
 <2><107a>: Abbrev Number: 18 (DW_TAG_inlined_subroutine)
    <107b>   DW_AT_abstract_origin: <0xcea>	
    <107f>   DW_AT_entry_pc    : 0xc0100794	
    <1083>   DW_AT_ranges      : 0x238	
    <1087>   DW_AT_call_file   : 1	
    <1088>   DW_AT_call_line   : 75	
    <1089>   DW_AT_sibling     : <0x10ab>	
 <3><108d>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <108e>   DW_AT_abstract_origin: <0xd18>	
    <1092>   DW_AT_const_value : 0	
 <3><1093>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <1094>   DW_AT_abstract_origin: <0xd0d>	
 <3><1098>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <1099>   DW_AT_abstract_origin: <0xd02>	
    <109d>   DW_AT_const_value : 8	
 <3><109e>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <109f>   DW_AT_abstract_origin: <0xcf7>	
    <10a3>   DW_AT_location    : 6 byte block: 3 28 32 10 c0 9f 	(DW_OP_addr: c0103228; DW_OP_stack_value)
 <2><10ab>: Abbrev Number: 18 (DW_TAG_inlined_subroutine)
    <10ac>   DW_AT_abstract_origin: <0xcea>	
    <10b0>   DW_AT_entry_pc    : 0xc0100844	
    <10b4>   DW_AT_ranges      : 0x258	
    <10b8>   DW_AT_call_file   : 1	
    <10b9>   DW_AT_call_line   : 76	
    <10ba>   DW_AT_sibling     : <0x10dc>	
 <3><10be>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <10bf>   DW_AT_abstract_origin: <0xd18>	
    <10c3>   DW_AT_const_value : 0	
 <3><10c4>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <10c5>   DW_AT_abstract_origin: <0xd0d>	
 <3><10c9>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <10ca>   DW_AT_abstract_origin: <0xd02>	
    <10ce>   DW_AT_const_value : 8	
 <3><10cf>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <10d0>   DW_AT_abstract_origin: <0xcf7>	
    <10d4>   DW_AT_location    : 6 byte block: 3 30 32 10 c0 9f 	(DW_OP_addr: c0103230; DW_OP_stack_value)
 <2><10dc>: Abbrev Number: 18 (DW_TAG_inlined_subroutine)
    <10dd>   DW_AT_abstract_origin: <0xcea>	
    <10e1>   DW_AT_entry_pc    : 0xc010085a	
    <10e5>   DW_AT_ranges      : 0x278	
    <10e9>   DW_AT_call_file   : 1	
    <10ea>   DW_AT_call_line   : 79	
    <10eb>   DW_AT_sibling     : <0x110d>	
 <3><10ef>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <10f0>   DW_AT_abstract_origin: <0xd18>	
    <10f4>   DW_AT_const_value : 3	
 <3><10f5>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <10f6>   DW_AT_abstract_origin: <0xd0d>	
 <3><10fa>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <10fb>   DW_AT_abstract_origin: <0xd02>	
    <10ff>   DW_AT_const_value : 8	
 <3><1100>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <1101>   DW_AT_abstract_origin: <0xcf7>	
    <1105>   DW_AT_location    : 6 byte block: 3 c0 35 10 c0 9f 	(DW_OP_addr: c01035c0; DW_OP_stack_value)
 <2><110d>: Abbrev Number: 18 (DW_TAG_inlined_subroutine)
    <110e>   DW_AT_abstract_origin: <0xd2a>	
    <1112>   DW_AT_entry_pc    : 0xc0100870	
    <1116>   DW_AT_ranges      : 0x290	
    <111a>   DW_AT_call_file   : 1	
    <111b>   DW_AT_call_line   : 81	
    <111c>   DW_AT_sibling     : <0x113e>	
 <3><1120>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <1121>   DW_AT_abstract_origin: <0xd58>	
    <1125>   DW_AT_const_value : 0	
 <3><1126>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <1127>   DW_AT_abstract_origin: <0xd4d>	
 <3><112b>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <112c>   DW_AT_abstract_origin: <0xd42>	
    <1130>   DW_AT_const_value : 8	
 <3><1131>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <1132>   DW_AT_abstract_origin: <0xd37>	
    <1136>   DW_AT_location    : 6 byte block: 3 c0 32 10 c0 9f 	(DW_OP_addr: c01032c0; DW_OP_stack_value)
 <2><113e>: Abbrev Number: 18 (DW_TAG_inlined_subroutine)
    <113f>   DW_AT_abstract_origin: <0xd2a>	
    <1143>   DW_AT_entry_pc    : 0xc0100886	
    <1147>   DW_AT_ranges      : 0x2a8	
    <114b>   DW_AT_call_file   : 1	
    <114c>   DW_AT_call_line   : 82	
    <114d>   DW_AT_sibling     : <0x116f>	
 <3><1151>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <1152>   DW_AT_abstract_origin: <0xd58>	
    <1156>   DW_AT_const_value : 0	
 <3><1157>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <1158>   DW_AT_abstract_origin: <0xd4d>	
 <3><115c>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <115d>   DW_AT_abstract_origin: <0xd42>	
    <1161>   DW_AT_const_value : 8	
 <3><1162>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <1163>   DW_AT_abstract_origin: <0xd37>	
    <1167>   DW_AT_location    : 6 byte block: 3 c8 32 10 c0 9f 	(DW_OP_addr: c01032c8; DW_OP_stack_value)
 <2><116f>: Abbrev Number: 18 (DW_TAG_inlined_subroutine)
    <1170>   DW_AT_abstract_origin: <0xd64>	
    <1174>   DW_AT_entry_pc    : 0xc010089c	
    <1178>   DW_AT_ranges      : 0x2c0	
    <117c>   DW_AT_call_file   : 1	
    <117d>   DW_AT_call_line   : 86	
    <117e>   DW_AT_sibling     : <0x11a7>	
 <3><1182>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <1183>   DW_AT_abstract_origin: <0xd7c>	
    <1187>   DW_AT_const_value : 2048	
 <3><1189>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <118a>   DW_AT_abstract_origin: <0xd71>	
    <118e>   DW_AT_location    : 6 byte block: 3 c0 31 10 c0 9f 	(DW_OP_addr: c01031c0; DW_OP_stack_value)
 <3><1195>: Abbrev Number: 24 (DW_TAG_lexical_block)
    <1196>   DW_AT_ranges      : 0x2e8	
 <4><119a>: Abbrev Number: 25 (DW_TAG_variable)
    <119b>   DW_AT_abstract_origin: <0xd87>	
    <119f>   DW_AT_location    : 5 byte block: 3 a0 31 10 c0 	(DW_OP_addr: c01031a0)
 <2><11a7>: Abbrev Number: 26 (DW_TAG_inlined_subroutine)
    <11a8>   DW_AT_abstract_origin: <0xd2a>	
    <11ac>   DW_AT_entry_pc    : 0xc01008a5	
    <11b0>   DW_AT_ranges      : 0x310	
    <11b4>   DW_AT_call_file   : 1	
    <11b5>   DW_AT_call_line   : 83	
 <3><11b6>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <11b7>   DW_AT_abstract_origin: <0xd58>	
    <11bb>   DW_AT_const_value : 0	
 <3><11bc>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <11bd>   DW_AT_abstract_origin: <0xd4d>	
 <3><11c1>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <11c2>   DW_AT_abstract_origin: <0xd42>	
    <11c6>   DW_AT_const_value : 8	
 <3><11c7>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <11c8>   DW_AT_abstract_origin: <0xd37>	
    <11cc>   DW_AT_location    : 6 byte block: 3 30 33 10 c0 9f 	(DW_OP_addr: c0103330; DW_OP_stack_value)
 <1><11d5>: Abbrev Number: 27 (DW_TAG_variable)
    <11d6>   DW_AT_name        : (indirect string, offset: 0x4a): dummy	
    <11da>   DW_AT_decl_file   : 5	
    <11db>   DW_AT_decl_line   : 8	
    <11dc>   DW_AT_type        : <0x11e6>	
    <11e0>   DW_AT_location    : 5 byte block: 3 a8 31 10 c0 	(DW_OP_addr: c01031a8)
 <1><11e6>: Abbrev Number: 15 (DW_TAG_volatile_type)
    <11e7>   DW_AT_type        : <0xc1c>	
 <1><11eb>: Abbrev Number: 13 (DW_TAG_array_type)
    <11ec>   DW_AT_type        : <0xcdf>	
    <11f0>   DW_AT_sibling     : <0x11fb>	
 <2><11f4>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <11f5>   DW_AT_type        : <0xc15>	
    <11f9>   DW_AT_upper_bound : 255	
 <1><11fb>: Abbrev Number: 28 (DW_TAG_variable)
    <11fc>   DW_AT_name        : idt	
    <1200>   DW_AT_decl_file   : 1	
    <1201>   DW_AT_decl_line   : 9	
    <1202>   DW_AT_type        : <0x11eb>	
    <1206>   DW_AT_location    : 5 byte block: 3 c0 31 10 c0 	(DW_OP_addr: c01031c0)
  Compilation Unit @ offset 0x120d:
   Length:        0x272 (32-bit)
   Version:       2
   Abbrev Offset: 1794
   Pointer Size:  4
 <0><1218>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <1219>   DW_AT_producer    : (indirect string, offset: 0x81): GNU C 4.6.3	
    <121d>   DW_AT_language    : 1	(ANSI C)
    <121e>   DW_AT_name        : (indirect string, offset: 0x2d2): src/kernel/irq/i8259.c	
    <1222>   DW_AT_comp_dir    : (indirect string, offset: 0x13): /home/lin/code/cslab/os-lab1	
    <1226>   DW_AT_low_pc      : 0xc0100950	
    <122a>   DW_AT_high_pc     : 0xc01009b7	
    <122e>   DW_AT_stmt_list   : 0x56c	
 <1><1232>: Abbrev Number: 2 (DW_TAG_base_type)
    <1233>   DW_AT_byte_size   : 4	
    <1234>   DW_AT_encoding    : 7	(unsigned)
    <1235>   DW_AT_name        : (indirect string, offset: 0x6): unsigned int	
 <1><1239>: Abbrev Number: 3 (DW_TAG_base_type)
    <123a>   DW_AT_byte_size   : 4	
    <123b>   DW_AT_encoding    : 5	(signed)
    <123c>   DW_AT_name        : int	
 <1><1240>: Abbrev Number: 4 (DW_TAG_typedef)
    <1241>   DW_AT_name        : (indirect string, offset: 0x152): uint16_t	
    <1245>   DW_AT_decl_file   : 3	
    <1246>   DW_AT_decl_line   : 9	
    <1247>   DW_AT_type        : <0x124b>	
 <1><124b>: Abbrev Number: 2 (DW_TAG_base_type)
    <124c>   DW_AT_byte_size   : 2	
    <124d>   DW_AT_encoding    : 7	(unsigned)
    <124e>   DW_AT_name        : (indirect string, offset: 0x0): short unsigned int	
 <1><1252>: Abbrev Number: 2 (DW_TAG_base_type)
    <1253>   DW_AT_byte_size   : 2	
    <1254>   DW_AT_encoding    : 5	(signed)
    <1255>   DW_AT_name        : (indirect string, offset: 0x9f): short int	
 <1><1259>: Abbrev Number: 4 (DW_TAG_typedef)
    <125a>   DW_AT_name        : (indirect string, offset: 0xd7): uint8_t	
    <125e>   DW_AT_decl_file   : 3	
    <125f>   DW_AT_decl_line   : 11	
    <1260>   DW_AT_type        : <0x1264>	
 <1><1264>: Abbrev Number: 2 (DW_TAG_base_type)
    <1265>   DW_AT_byte_size   : 1	
    <1266>   DW_AT_encoding    : 8	(unsigned char)
    <1267>   DW_AT_name        : (indirect string, offset: 0x6a): unsigned char	
 <1><126b>: Abbrev Number: 2 (DW_TAG_base_type)
    <126c>   DW_AT_byte_size   : 1	
    <126d>   DW_AT_encoding    : 6	(signed char)
    <126e>   DW_AT_name        : (indirect string, offset: 0x73): char	
 <1><1272>: Abbrev Number: 5 (DW_TAG_subprogram)
    <1273>   DW_AT_name        : (indirect string, offset: 0x122): out_byte	
    <1277>   DW_AT_decl_file   : 2	
    <1278>   DW_AT_decl_line   : 21	
    <1279>   DW_AT_prototyped  : 1	
    <127a>   DW_AT_inline      : 3	(declared as inline and inlined)
    <127b>   DW_AT_sibling     : <0x1296>	
 <2><127f>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <1280>   DW_AT_name        : (indirect string, offset: 0x130): port	
    <1284>   DW_AT_decl_file   : 2	
    <1285>   DW_AT_decl_line   : 21	
    <1286>   DW_AT_type        : <0x1240>	
 <2><128a>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <128b>   DW_AT_name        : (indirect string, offset: 0xc1): data	
    <128f>   DW_AT_decl_file   : 2	
    <1290>   DW_AT_decl_line   : 21	
    <1291>   DW_AT_type        : <0x1259>	
 <1><1296>: Abbrev Number: 7 (DW_TAG_subprogram)
    <1297>   DW_AT_external    : 1	
    <1298>   DW_AT_name        : (indirect string, offset: 0x2c8): init_intr	
    <129c>   DW_AT_decl_file   : 1	
    <129d>   DW_AT_decl_line   : 7	
    <129e>   DW_AT_prototyped  : 1	
    <129f>   DW_AT_low_pc      : 0xc0100950	
    <12a3>   DW_AT_high_pc     : 0xc01009b7	
    <12a7>   DW_AT_frame_base  : 0x77a	(location list)
    <12ab>   DW_AT_sibling     : <0x146c>	
 <2><12af>: Abbrev Number: 8 (DW_TAG_inlined_subroutine)
    <12b0>   DW_AT_abstract_origin: <0x1272>	
    <12b4>   DW_AT_entry_pc    : 0xc0100951	
    <12b8>   DW_AT_ranges      : 0x330	
    <12bc>   DW_AT_call_file   : 1	
    <12bd>   DW_AT_call_line   : 9	
    <12be>   DW_AT_sibling     : <0x12cf>	
 <3><12c2>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <12c3>   DW_AT_abstract_origin: <0x128a>	
    <12c7>   DW_AT_const_value : -1	
 <3><12c8>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <12c9>   DW_AT_abstract_origin: <0x127f>	
    <12cd>   DW_AT_const_value : 33	
 <2><12cf>: Abbrev Number: 11 (DW_TAG_inlined_subroutine)
    <12d0>   DW_AT_abstract_origin: <0x1272>	
    <12d4>   DW_AT_low_pc      : 0xc010095e	
    <12d8>   DW_AT_high_pc     : 0xc0100961	
    <12dc>   DW_AT_call_file   : 1	
    <12dd>   DW_AT_call_line   : 10	
    <12de>   DW_AT_sibling     : <0x12ef>	
 <3><12e2>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <12e3>   DW_AT_abstract_origin: <0x128a>	
    <12e7>   DW_AT_const_value : -1	
 <3><12e8>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <12e9>   DW_AT_abstract_origin: <0x127f>	
    <12ed>   DW_AT_const_value : 161	
 <2><12ef>: Abbrev Number: 11 (DW_TAG_inlined_subroutine)
    <12f0>   DW_AT_abstract_origin: <0x1272>	
    <12f4>   DW_AT_low_pc      : 0xc0100961	
    <12f8>   DW_AT_high_pc     : 0xc0100969	
    <12fc>   DW_AT_call_file   : 1	
    <12fd>   DW_AT_call_line   : 13	
    <12fe>   DW_AT_sibling     : <0x130f>	
 <3><1302>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1303>   DW_AT_abstract_origin: <0x128a>	
    <1307>   DW_AT_const_value : 17	
 <3><1308>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1309>   DW_AT_abstract_origin: <0x127f>	
    <130d>   DW_AT_const_value : 32	
 <2><130f>: Abbrev Number: 11 (DW_TAG_inlined_subroutine)
    <1310>   DW_AT_abstract_origin: <0x1272>	
    <1314>   DW_AT_low_pc      : 0xc0100969	
    <1318>   DW_AT_high_pc     : 0xc0100971	
    <131c>   DW_AT_call_file   : 1	
    <131d>   DW_AT_call_line   : 14	
    <131e>   DW_AT_sibling     : <0x132f>	
 <3><1322>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1323>   DW_AT_abstract_origin: <0x128a>	
    <1327>   DW_AT_const_value : 32	
 <3><1328>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1329>   DW_AT_abstract_origin: <0x127f>	
    <132d>   DW_AT_const_value : 33	
 <2><132f>: Abbrev Number: 11 (DW_TAG_inlined_subroutine)
    <1330>   DW_AT_abstract_origin: <0x1272>	
    <1334>   DW_AT_low_pc      : 0xc0100971	
    <1338>   DW_AT_high_pc     : 0xc0100977	
    <133c>   DW_AT_call_file   : 1	
    <133d>   DW_AT_call_line   : 15	
    <133e>   DW_AT_sibling     : <0x134f>	
 <3><1342>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1343>   DW_AT_abstract_origin: <0x128a>	
    <1347>   DW_AT_const_value : 4	
 <3><1348>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1349>   DW_AT_abstract_origin: <0x127f>	
    <134d>   DW_AT_const_value : 33	
 <2><134f>: Abbrev Number: 11 (DW_TAG_inlined_subroutine)
    <1350>   DW_AT_abstract_origin: <0x1272>	
    <1354>   DW_AT_low_pc      : 0xc0100977	
    <1358>   DW_AT_high_pc     : 0xc010097d	
    <135c>   DW_AT_call_file   : 1	
    <135d>   DW_AT_call_line   : 16	
    <135e>   DW_AT_sibling     : <0x136f>	
 <3><1362>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1363>   DW_AT_abstract_origin: <0x128a>	
    <1367>   DW_AT_const_value : 3	
 <3><1368>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1369>   DW_AT_abstract_origin: <0x127f>	
    <136d>   DW_AT_const_value : 33	
 <2><136f>: Abbrev Number: 11 (DW_TAG_inlined_subroutine)
    <1370>   DW_AT_abstract_origin: <0x1272>	
    <1374>   DW_AT_low_pc      : 0xc010097d	
    <1378>   DW_AT_high_pc     : 0xc0100985	
    <137c>   DW_AT_call_file   : 1	
    <137d>   DW_AT_call_line   : 17	
    <137e>   DW_AT_sibling     : <0x138f>	
 <3><1382>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1383>   DW_AT_abstract_origin: <0x128a>	
    <1387>   DW_AT_const_value : 17	
 <3><1388>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1389>   DW_AT_abstract_origin: <0x127f>	
    <138d>   DW_AT_const_value : 160	
 <2><138f>: Abbrev Number: 11 (DW_TAG_inlined_subroutine)
    <1390>   DW_AT_abstract_origin: <0x1272>	
    <1394>   DW_AT_low_pc      : 0xc0100985	
    <1398>   DW_AT_high_pc     : 0xc010098d	
    <139c>   DW_AT_call_file   : 1	
    <139d>   DW_AT_call_line   : 18	
    <139e>   DW_AT_sibling     : <0x13af>	
 <3><13a2>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <13a3>   DW_AT_abstract_origin: <0x128a>	
    <13a7>   DW_AT_const_value : 40	
 <3><13a8>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <13a9>   DW_AT_abstract_origin: <0x127f>	
    <13ad>   DW_AT_const_value : 161	
 <2><13af>: Abbrev Number: 11 (DW_TAG_inlined_subroutine)
    <13b0>   DW_AT_abstract_origin: <0x1272>	
    <13b4>   DW_AT_low_pc      : 0xc010098d	
    <13b8>   DW_AT_high_pc     : 0xc0100993	
    <13bc>   DW_AT_call_file   : 1	
    <13bd>   DW_AT_call_line   : 19	
    <13be>   DW_AT_sibling     : <0x13cf>	
 <3><13c2>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <13c3>   DW_AT_abstract_origin: <0x128a>	
    <13c7>   DW_AT_const_value : 2	
 <3><13c8>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <13c9>   DW_AT_abstract_origin: <0x127f>	
    <13cd>   DW_AT_const_value : 161	
 <2><13cf>: Abbrev Number: 11 (DW_TAG_inlined_subroutine)
    <13d0>   DW_AT_abstract_origin: <0x1272>	
    <13d4>   DW_AT_low_pc      : 0xc0100993	
    <13d8>   DW_AT_high_pc     : 0xc0100999	
    <13dc>   DW_AT_call_file   : 1	
    <13dd>   DW_AT_call_line   : 20	
    <13de>   DW_AT_sibling     : <0x13ef>	
 <3><13e2>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <13e3>   DW_AT_abstract_origin: <0x128a>	
    <13e7>   DW_AT_const_value : 3	
 <3><13e8>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <13e9>   DW_AT_abstract_origin: <0x127f>	
    <13ed>   DW_AT_const_value : 161	
 <2><13ef>: Abbrev Number: 11 (DW_TAG_inlined_subroutine)
    <13f0>   DW_AT_abstract_origin: <0x1272>	
    <13f4>   DW_AT_low_pc      : 0xc0100999	
    <13f8>   DW_AT_high_pc     : 0xc01009a1	
    <13fc>   DW_AT_call_file   : 1	
    <13fd>   DW_AT_call_line   : 21	
    <13fe>   DW_AT_sibling     : <0x140f>	
 <3><1402>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1403>   DW_AT_abstract_origin: <0x128a>	
    <1407>   DW_AT_const_value : 104	
 <3><1408>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1409>   DW_AT_abstract_origin: <0x127f>	
    <140d>   DW_AT_const_value : 32	
 <2><140f>: Abbrev Number: 11 (DW_TAG_inlined_subroutine)
    <1410>   DW_AT_abstract_origin: <0x1272>	
    <1414>   DW_AT_low_pc      : 0xc01009a1	
    <1418>   DW_AT_high_pc     : 0xc01009a7	
    <141c>   DW_AT_call_file   : 1	
    <141d>   DW_AT_call_line   : 22	
    <141e>   DW_AT_sibling     : <0x142f>	
 <3><1422>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1423>   DW_AT_abstract_origin: <0x128a>	
    <1427>   DW_AT_const_value : 10	
 <3><1428>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1429>   DW_AT_abstract_origin: <0x127f>	
    <142d>   DW_AT_const_value : 32	
 <2><142f>: Abbrev Number: 11 (DW_TAG_inlined_subroutine)
    <1430>   DW_AT_abstract_origin: <0x1272>	
    <1434>   DW_AT_low_pc      : 0xc01009a7	
    <1438>   DW_AT_high_pc     : 0xc01009af	
    <143c>   DW_AT_call_file   : 1	
    <143d>   DW_AT_call_line   : 23	
    <143e>   DW_AT_sibling     : <0x144f>	
 <3><1442>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1443>   DW_AT_abstract_origin: <0x128a>	
    <1447>   DW_AT_const_value : 104	
 <3><1448>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1449>   DW_AT_abstract_origin: <0x127f>	
    <144d>   DW_AT_const_value : 160	
 <2><144f>: Abbrev Number: 12 (DW_TAG_inlined_subroutine)
    <1450>   DW_AT_abstract_origin: <0x1272>	
    <1454>   DW_AT_low_pc      : 0xc01009af	
    <1458>   DW_AT_high_pc     : 0xc01009b5	
    <145c>   DW_AT_call_file   : 1	
    <145d>   DW_AT_call_line   : 24	
 <3><145e>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <145f>   DW_AT_abstract_origin: <0x128a>	
    <1463>   DW_AT_const_value : 10	
 <3><1464>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <1465>   DW_AT_abstract_origin: <0x127f>	
    <1469>   DW_AT_const_value : 160	
 <1><146c>: Abbrev Number: 13 (DW_TAG_variable)
    <146d>   DW_AT_name        : (indirect string, offset: 0x4a): dummy	
    <1471>   DW_AT_decl_file   : 4	
    <1472>   DW_AT_decl_line   : 8	
    <1473>   DW_AT_type        : <0x147d>	
    <1477>   DW_AT_location    : 5 byte block: 3 c0 39 10 c0 	(DW_OP_addr: c01039c0)
 <1><147d>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <147e>   DW_AT_type        : <0x1239>	
  Compilation Unit @ offset 0x1483:
   Length:        0x2ff (32-bit)
   Version:       2
   Abbrev Offset: 1991
   Pointer Size:  4
 <0><148e>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <148f>   DW_AT_producer    : (indirect string, offset: 0x81): GNU C 4.6.3	
    <1493>   DW_AT_language    : 1	(ANSI C)
    <1494>   DW_AT_name        : (indirect string, offset: 0x311): src/kernel/process/schedule.c	
    <1498>   DW_AT_comp_dir    : (indirect string, offset: 0x13): /home/lin/code/cslab/os-lab1	
    <149c>   DW_AT_low_pc      : 0xc01009c0	
    <14a0>   DW_AT_high_pc     : 0xc0100a83	
    <14a4>   DW_AT_stmt_list   : 0x5fb	
 <1><14a8>: Abbrev Number: 2 (DW_TAG_base_type)
    <14a9>   DW_AT_byte_size   : 4	
    <14aa>   DW_AT_encoding    : 7	(unsigned)
    <14ab>   DW_AT_name        : (indirect string, offset: 0x6): unsigned int	
 <1><14af>: Abbrev Number: 3 (DW_TAG_base_type)
    <14b0>   DW_AT_byte_size   : 4	
    <14b1>   DW_AT_encoding    : 5	(signed)
    <14b2>   DW_AT_name        : int	
 <1><14b6>: Abbrev Number: 2 (DW_TAG_base_type)
    <14b7>   DW_AT_byte_size   : 2	
    <14b8>   DW_AT_encoding    : 7	(unsigned)
    <14b9>   DW_AT_name        : (indirect string, offset: 0x0): short unsigned int	
 <1><14bd>: Abbrev Number: 2 (DW_TAG_base_type)
    <14be>   DW_AT_byte_size   : 2	
    <14bf>   DW_AT_encoding    : 5	(signed)
    <14c0>   DW_AT_name        : (indirect string, offset: 0x9f): short int	
 <1><14c4>: Abbrev Number: 4 (DW_TAG_typedef)
    <14c5>   DW_AT_name        : (indirect string, offset: 0xd7): uint8_t	
    <14c9>   DW_AT_decl_file   : 4	
    <14ca>   DW_AT_decl_line   : 11	
    <14cb>   DW_AT_type        : <0x14cf>	
 <1><14cf>: Abbrev Number: 2 (DW_TAG_base_type)
    <14d0>   DW_AT_byte_size   : 1	
    <14d1>   DW_AT_encoding    : 8	(unsigned char)
    <14d2>   DW_AT_name        : (indirect string, offset: 0x6a): unsigned char	
 <1><14d6>: Abbrev Number: 2 (DW_TAG_base_type)
    <14d7>   DW_AT_byte_size   : 1	
    <14d8>   DW_AT_encoding    : 6	(signed char)
    <14d9>   DW_AT_name        : (indirect string, offset: 0x73): char	
 <1><14dd>: Abbrev Number: 5 (DW_TAG_structure_type)
    <14de>   DW_AT_name        : (indirect string, offset: 0x210): ListHead	
    <14e2>   DW_AT_byte_size   : 8	
    <14e3>   DW_AT_decl_file   : 2	
    <14e4>   DW_AT_decl_line   : 6	
    <14e5>   DW_AT_sibling     : <0x1506>	
 <2><14e9>: Abbrev Number: 6 (DW_TAG_member)
    <14ea>   DW_AT_name        : (indirect string, offset: 0x219): prev	
    <14ee>   DW_AT_decl_file   : 2	
    <14ef>   DW_AT_decl_line   : 7	
    <14f0>   DW_AT_type        : <0x1506>	
    <14f4>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><14f7>: Abbrev Number: 6 (DW_TAG_member)
    <14f8>   DW_AT_name        : (indirect string, offset: 0x21e): next	
    <14fc>   DW_AT_decl_file   : 2	
    <14fd>   DW_AT_decl_line   : 7	
    <14fe>   DW_AT_type        : <0x1506>	
    <1502>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <1><1506>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1507>   DW_AT_byte_size   : 4	
    <1508>   DW_AT_type        : <0x14dd>	
 <1><150c>: Abbrev Number: 4 (DW_TAG_typedef)
    <150d>   DW_AT_name        : (indirect string, offset: 0x210): ListHead	
    <1511>   DW_AT_decl_file   : 2	
    <1512>   DW_AT_decl_line   : 9	
    <1513>   DW_AT_type        : <0x14dd>	
 <1><1517>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1518>   DW_AT_name        : PCB	
    <151c>   DW_AT_byte_size   : 4108	
    <151e>   DW_AT_decl_file   : 5	
    <151f>   DW_AT_decl_line   : 4	
    <1520>   DW_AT_sibling     : <0x154f>	
 <2><1524>: Abbrev Number: 9 (DW_TAG_member)
    <1525>   DW_AT_name        : tf	
    <1528>   DW_AT_decl_file   : 5	
    <1529>   DW_AT_decl_line   : 5	
    <152a>   DW_AT_type        : <0x154f>	
    <152e>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1531>: Abbrev Number: 6 (DW_TAG_member)
    <1532>   DW_AT_name        : (indirect string, offset: 0x1e6): kstack	
    <1536>   DW_AT_decl_file   : 5	
    <1537>   DW_AT_decl_line   : 6	
    <1538>   DW_AT_type        : <0x1551>	
    <153c>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><153f>: Abbrev Number: 6 (DW_TAG_member)
    <1540>   DW_AT_name        : (indirect string, offset: 0x1f7): list	
    <1544>   DW_AT_decl_file   : 5	
    <1545>   DW_AT_decl_line   : 7	
    <1546>   DW_AT_type        : <0x150c>	
    <154a>   DW_AT_data_member_location: 3 byte block: 23 84 20 	(DW_OP_plus_uconst: 4100)
 <1><154f>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <1550>   DW_AT_byte_size   : 4	
 <1><1551>: Abbrev Number: 11 (DW_TAG_array_type)
    <1552>   DW_AT_type        : <0x14c4>	
    <1556>   DW_AT_sibling     : <0x1562>	
 <2><155a>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <155b>   DW_AT_type        : <0x14a8>	
    <155f>   DW_AT_upper_bound : 4095	
 <1><1562>: Abbrev Number: 13 (DW_TAG_typedef)
    <1563>   DW_AT_name        : PCB	
    <1567>   DW_AT_decl_file   : 5	
    <1568>   DW_AT_decl_line   : 8	
    <1569>   DW_AT_type        : <0x1517>	
 <1><156d>: Abbrev Number: 14 (DW_TAG_subprogram)
    <156e>   DW_AT_name        : cli	
    <1572>   DW_AT_decl_file   : 3	
    <1573>   DW_AT_decl_line   : 101	
    <1574>   DW_AT_prototyped  : 1	
    <1575>   DW_AT_inline      : 3	(declared as inline and inlined)
 <1><1576>: Abbrev Number: 15 (DW_TAG_subprogram)
    <1577>   DW_AT_name        : (indirect string, offset: 0x1ed): wait_intr	
    <157b>   DW_AT_decl_file   : 3	
    <157c>   DW_AT_decl_line   : 107	
    <157d>   DW_AT_inline      : 3	(declared as inline and inlined)
 <1><157e>: Abbrev Number: 16 (DW_TAG_subprogram)
    <157f>   DW_AT_name        : (indirect string, offset: 0x2ef): list_add	
    <1583>   DW_AT_decl_file   : 2	
    <1584>   DW_AT_decl_line   : 15	
    <1585>   DW_AT_prototyped  : 1	
    <1586>   DW_AT_inline      : 3	(declared as inline and inlined)
    <1587>   DW_AT_sibling     : <0x15bb>	
 <2><158b>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <158c>   DW_AT_name        : (indirect string, offset: 0x219): prev	
    <1590>   DW_AT_decl_file   : 2	
    <1591>   DW_AT_decl_line   : 15	
    <1592>   DW_AT_type        : <0x15bb>	
 <2><1596>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <1597>   DW_AT_name        : (indirect string, offset: 0x21e): next	
    <159b>   DW_AT_decl_file   : 2	
    <159c>   DW_AT_decl_line   : 15	
    <159d>   DW_AT_type        : <0x15bb>	
 <2><15a1>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <15a2>   DW_AT_name        : (indirect string, offset: 0xc1): data	
    <15a6>   DW_AT_decl_file   : 2	
    <15a7>   DW_AT_decl_line   : 15	
    <15a8>   DW_AT_type        : <0x15bb>	
 <2><15ac>: Abbrev Number: 18 (DW_TAG_variable)
    <15ad>   DW_AT_name        : (indirect string, offset: 0x1c2): __FUNCTION__	
    <15b1>   DW_AT_type        : <0x15d1>	
    <15b5>   DW_AT_artificial  : 1	
    <15b6>   DW_AT_const_value : (indirect string, offset: 0x2ef): list_add	
 <1><15bb>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <15bc>   DW_AT_byte_size   : 4	
    <15bd>   DW_AT_type        : <0x150c>	
 <1><15c1>: Abbrev Number: 11 (DW_TAG_array_type)
    <15c2>   DW_AT_type        : <0x14d6>	
    <15c6>   DW_AT_sibling     : <0x15d1>	
 <2><15ca>: Abbrev Number: 19 (DW_TAG_subrange_type)
    <15cb>   DW_AT_type        : <0x14a8>	
    <15cf>   DW_AT_upper_bound : 8	
 <1><15d1>: Abbrev Number: 20 (DW_TAG_const_type)
    <15d2>   DW_AT_type        : <0x15c1>	
 <1><15d6>: Abbrev Number: 16 (DW_TAG_subprogram)
    <15d7>   DW_AT_name        : (indirect string, offset: 0x32f): list_del	
    <15db>   DW_AT_decl_file   : 2	
    <15dc>   DW_AT_decl_line   : 36	
    <15dd>   DW_AT_prototyped  : 1	
    <15de>   DW_AT_inline      : 3	(declared as inline and inlined)
    <15df>   DW_AT_sibling     : <0x1613>	
 <2><15e3>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <15e4>   DW_AT_name        : (indirect string, offset: 0xc1): data	
    <15e8>   DW_AT_decl_file   : 2	
    <15e9>   DW_AT_decl_line   : 36	
    <15ea>   DW_AT_type        : <0x15bb>	
 <2><15ee>: Abbrev Number: 18 (DW_TAG_variable)
    <15ef>   DW_AT_name        : (indirect string, offset: 0x1c2): __FUNCTION__	
    <15f3>   DW_AT_type        : <0x1613>	
    <15f7>   DW_AT_artificial  : 1	
    <15f8>   DW_AT_const_value : (indirect string, offset: 0x32f): list_del	
 <2><15fc>: Abbrev Number: 21 (DW_TAG_variable)
    <15fd>   DW_AT_name        : (indirect string, offset: 0x219): prev	
    <1601>   DW_AT_decl_file   : 2	
    <1602>   DW_AT_decl_line   : 38	
    <1603>   DW_AT_type        : <0x15bb>	
 <2><1607>: Abbrev Number: 21 (DW_TAG_variable)
    <1608>   DW_AT_name        : (indirect string, offset: 0x21e): next	
    <160c>   DW_AT_decl_file   : 2	
    <160d>   DW_AT_decl_line   : 39	
    <160e>   DW_AT_type        : <0x15bb>	
 <1><1613>: Abbrev Number: 20 (DW_TAG_const_type)
    <1614>   DW_AT_type        : <0x15c1>	
 <1><1618>: Abbrev Number: 16 (DW_TAG_subprogram)
    <1619>   DW_AT_name        : (indirect string, offset: 0x2f8): list_add_before	
    <161d>   DW_AT_decl_file   : 2	
    <161e>   DW_AT_decl_line   : 24	
    <161f>   DW_AT_prototyped  : 1	
    <1620>   DW_AT_inline      : 3	(declared as inline and inlined)
    <1621>   DW_AT_sibling     : <0x164a>	
 <2><1625>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <1626>   DW_AT_name        : (indirect string, offset: 0x1f7): list	
    <162a>   DW_AT_decl_file   : 2	
    <162b>   DW_AT_decl_line   : 24	
    <162c>   DW_AT_type        : <0x15bb>	
 <2><1630>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <1631>   DW_AT_name        : (indirect string, offset: 0xc1): data	
    <1635>   DW_AT_decl_file   : 2	
    <1636>   DW_AT_decl_line   : 24	
    <1637>   DW_AT_type        : <0x15bb>	
 <2><163b>: Abbrev Number: 18 (DW_TAG_variable)
    <163c>   DW_AT_name        : (indirect string, offset: 0x1c2): __FUNCTION__	
    <1640>   DW_AT_type        : <0x165a>	
    <1644>   DW_AT_artificial  : 1	
    <1645>   DW_AT_const_value : (indirect string, offset: 0x2f8): list_add_before	
 <1><164a>: Abbrev Number: 11 (DW_TAG_array_type)
    <164b>   DW_AT_type        : <0x14d6>	
    <164f>   DW_AT_sibling     : <0x165a>	
 <2><1653>: Abbrev Number: 19 (DW_TAG_subrange_type)
    <1654>   DW_AT_type        : <0x14a8>	
    <1658>   DW_AT_upper_bound : 15	
 <1><165a>: Abbrev Number: 20 (DW_TAG_const_type)
    <165b>   DW_AT_type        : <0x164a>	
 <1><165f>: Abbrev Number: 22 (DW_TAG_subprogram)
    <1660>   DW_AT_external    : 1	
    <1661>   DW_AT_name        : (indirect string, offset: 0x308): schedule	
    <1665>   DW_AT_decl_file   : 1	
    <1666>   DW_AT_decl_line   : 5	
    <1667>   DW_AT_prototyped  : 1	
    <1668>   DW_AT_low_pc      : 0xc01009c0	
    <166c>   DW_AT_high_pc     : 0xc0100a83	
    <1670>   DW_AT_frame_base  : 0x7b2	(location list)
    <1674>   DW_AT_sibling     : <0x1738>	
 <2><1678>: Abbrev Number: 21 (DW_TAG_variable)
    <1679>   DW_AT_name        : (indirect string, offset: 0x1f7): list	
    <167d>   DW_AT_decl_file   : 1	
    <167e>   DW_AT_decl_line   : 7	
    <167f>   DW_AT_type        : <0x15bb>	
 <2><1683>: Abbrev Number: 23 (DW_TAG_variable)
    <1684>   DW_AT_name        : now	
    <1688>   DW_AT_decl_file   : 1	
    <1689>   DW_AT_decl_line   : 9	
    <168a>   DW_AT_type        : <0x15bb>	
 <2><168e>: Abbrev Number: 24 (DW_TAG_inlined_subroutine)
    <168f>   DW_AT_abstract_origin: <0x15d6>	
    <1693>   DW_AT_entry_pc    : 0xc01009d6	
    <1697>   DW_AT_ranges      : 0x348	
    <169b>   DW_AT_call_file   : 1	
    <169c>   DW_AT_call_line   : 11	
    <169d>   DW_AT_sibling     : <0x16e0>	
 <3><16a1>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <16a2>   DW_AT_abstract_origin: <0x15e3>	
 <3><16a6>: Abbrev Number: 26 (DW_TAG_lexical_block)
    <16a7>   DW_AT_ranges      : 0x360	
 <4><16ab>: Abbrev Number: 27 (DW_TAG_variable)
    <16ac>   DW_AT_abstract_origin: <0x15fc>	
 <4><16b0>: Abbrev Number: 27 (DW_TAG_variable)
    <16b1>   DW_AT_abstract_origin: <0x1607>	
 <4><16b5>: Abbrev Number: 28 (DW_TAG_variable)
    <16b6>   DW_AT_abstract_origin: <0x15ee>	
    <16ba>   DW_AT_location    : 5 byte block: 3 f0 14 10 c0 	(DW_OP_addr: c01014f0)
 <4><16c0>: Abbrev Number: 29 (DW_TAG_inlined_subroutine)
    <16c1>   DW_AT_abstract_origin: <0x156d>	
    <16c5>   DW_AT_low_pc      : 0xc0100a29	
    <16c9>   DW_AT_high_pc     : 0xc0100a2a	
    <16cd>   DW_AT_call_file   : 2	
    <16ce>   DW_AT_call_line   : 37	
 <4><16cf>: Abbrev Number: 29 (DW_TAG_inlined_subroutine)
    <16d0>   DW_AT_abstract_origin: <0x1576>	
    <16d4>   DW_AT_low_pc      : 0xc0100a80	
    <16d8>   DW_AT_high_pc     : 0xc0100a83	
    <16dc>   DW_AT_call_file   : 2	
    <16dd>   DW_AT_call_line   : 37	
 <2><16e0>: Abbrev Number: 30 (DW_TAG_inlined_subroutine)
    <16e1>   DW_AT_abstract_origin: <0x1618>	
    <16e5>   DW_AT_low_pc      : 0xc01009ec	
    <16e9>   DW_AT_high_pc     : 0xc0100a07	
    <16ed>   DW_AT_call_file   : 1	
    <16ee>   DW_AT_call_line   : 12	
 <3><16ef>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <16f0>   DW_AT_abstract_origin: <0x1630>	
 <3><16f4>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <16f5>   DW_AT_abstract_origin: <0x1625>	
 <3><16f9>: Abbrev Number: 31 (DW_TAG_lexical_block)
    <16fa>   DW_AT_low_pc      : 0xc01009ec	
    <16fe>   DW_AT_high_pc     : 0xc0100a07	
 <4><1702>: Abbrev Number: 27 (DW_TAG_variable)
    <1703>   DW_AT_abstract_origin: <0x163b>	
 <4><1707>: Abbrev Number: 30 (DW_TAG_inlined_subroutine)
    <1708>   DW_AT_abstract_origin: <0x157e>	
    <170c>   DW_AT_low_pc      : 0xc01009f2	
    <1710>   DW_AT_high_pc     : 0xc0100a07	
    <1714>   DW_AT_call_file   : 2	
    <1715>   DW_AT_call_line   : 26	
 <5><1716>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <1717>   DW_AT_abstract_origin: <0x15a1>	
 <5><171b>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <171c>   DW_AT_abstract_origin: <0x1596>	
 <5><1720>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <1721>   DW_AT_abstract_origin: <0x158b>	
 <5><1725>: Abbrev Number: 31 (DW_TAG_lexical_block)
    <1726>   DW_AT_low_pc      : 0xc01009f2	
    <172a>   DW_AT_high_pc     : 0xc0100a07	
 <6><172e>: Abbrev Number: 27 (DW_TAG_variable)
    <172f>   DW_AT_abstract_origin: <0x15ac>	
 <1><1738>: Abbrev Number: 32 (DW_TAG_variable)
    <1739>   DW_AT_name        : (indirect string, offset: 0x4a): dummy	
    <173d>   DW_AT_decl_file   : 6	
    <173e>   DW_AT_decl_line   : 8	
    <173f>   DW_AT_type        : <0x1749>	
    <1743>   DW_AT_location    : 5 byte block: 3 c4 39 10 c0 	(DW_OP_addr: c01039c4)
 <1><1749>: Abbrev Number: 33 (DW_TAG_volatile_type)
    <174a>   DW_AT_type        : <0x14af>	
 <1><174e>: Abbrev Number: 34 (DW_TAG_variable)
    <174f>   DW_AT_name        : (indirect string, offset: 0x1de): current	
    <1753>   DW_AT_decl_file   : 1	
    <1754>   DW_AT_decl_line   : 3	
    <1755>   DW_AT_type        : <0x1760>	
    <1759>   DW_AT_external    : 1	
    <175a>   DW_AT_location    : 5 byte block: 3 58 21 10 c0 	(DW_OP_addr: c0102158)
 <1><1760>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1761>   DW_AT_byte_size   : 4	
    <1762>   DW_AT_type        : <0x1562>	
 <1><1766>: Abbrev Number: 35 (DW_TAG_variable)
    <1767>   DW_AT_name        : (indirect string, offset: 0x2e9): ready	
    <176b>   DW_AT_decl_file   : 5	
    <176c>   DW_AT_decl_line   : 10	
    <176d>   DW_AT_type        : <0x150c>	
    <1771>   DW_AT_external    : 1	
    <1772>   DW_AT_declaration : 1	
 <1><1773>: Abbrev Number: 34 (DW_TAG_variable)
    <1774>   DW_AT_name        : (indirect string, offset: 0x10f): idle	
    <1778>   DW_AT_decl_file   : 1	
    <1779>   DW_AT_decl_line   : 3	
    <177a>   DW_AT_type        : <0x1562>	
    <177e>   DW_AT_external    : 1	
    <177f>   DW_AT_location    : 5 byte block: 3 c0 60 12 c0 	(DW_OP_addr: c01260c0)
  Compilation Unit @ offset 0x1786:
   Length:        0x99e (32-bit)
   Version:       2
   Abbrev Offset: 2431
   Pointer Size:  4
 <0><1791>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <1792>   DW_AT_producer    : (indirect string, offset: 0x81): GNU C 4.6.3	
    <1796>   DW_AT_language    : 1	(ANSI C)
    <1797>   DW_AT_name        : (indirect string, offset: 0x356): src/kernel/process/util.c	
    <179b>   DW_AT_comp_dir    : (indirect string, offset: 0x13): /home/lin/code/cslab/os-lab1	
    <179f>   DW_AT_low_pc      : 0xc0100a90	
    <17a3>   DW_AT_high_pc     : 0xc0100eba	
    <17a7>   DW_AT_stmt_list   : 0x6d9	
 <1><17ab>: Abbrev Number: 2 (DW_TAG_typedef)
    <17ac>   DW_AT_name        : (indirect string, offset: 0x78): uint32_t	
    <17b0>   DW_AT_decl_file   : 4	
    <17b1>   DW_AT_decl_line   : 7	
    <17b2>   DW_AT_type        : <0x17b6>	
 <1><17b6>: Abbrev Number: 3 (DW_TAG_base_type)
    <17b7>   DW_AT_byte_size   : 4	
    <17b8>   DW_AT_encoding    : 7	(unsigned)
    <17b9>   DW_AT_name        : (indirect string, offset: 0x6): unsigned int	
 <1><17bd>: Abbrev Number: 2 (DW_TAG_typedef)
    <17be>   DW_AT_name        : (indirect string, offset: 0x79): int32_t	
    <17c2>   DW_AT_decl_file   : 4	
    <17c3>   DW_AT_decl_line   : 8	
    <17c4>   DW_AT_type        : <0x17c8>	
 <1><17c8>: Abbrev Number: 4 (DW_TAG_base_type)
    <17c9>   DW_AT_byte_size   : 4	
    <17ca>   DW_AT_encoding    : 5	(signed)
    <17cb>   DW_AT_name        : int	
 <1><17cf>: Abbrev Number: 3 (DW_TAG_base_type)
    <17d0>   DW_AT_byte_size   : 2	
    <17d1>   DW_AT_encoding    : 7	(unsigned)
    <17d2>   DW_AT_name        : (indirect string, offset: 0x0): short unsigned int	
 <1><17d6>: Abbrev Number: 3 (DW_TAG_base_type)
    <17d7>   DW_AT_byte_size   : 2	
    <17d8>   DW_AT_encoding    : 5	(signed)
    <17d9>   DW_AT_name        : (indirect string, offset: 0x9f): short int	
 <1><17dd>: Abbrev Number: 2 (DW_TAG_typedef)
    <17de>   DW_AT_name        : (indirect string, offset: 0xd7): uint8_t	
    <17e2>   DW_AT_decl_file   : 4	
    <17e3>   DW_AT_decl_line   : 11	
    <17e4>   DW_AT_type        : <0x17e8>	
 <1><17e8>: Abbrev Number: 3 (DW_TAG_base_type)
    <17e9>   DW_AT_byte_size   : 1	
    <17ea>   DW_AT_encoding    : 8	(unsigned char)
    <17eb>   DW_AT_name        : (indirect string, offset: 0x6a): unsigned char	
 <1><17ef>: Abbrev Number: 3 (DW_TAG_base_type)
    <17f0>   DW_AT_byte_size   : 1	
    <17f1>   DW_AT_encoding    : 6	(signed char)
    <17f2>   DW_AT_name        : (indirect string, offset: 0x73): char	
 <1><17f6>: Abbrev Number: 5 (DW_TAG_structure_type)
    <17f7>   DW_AT_name        : (indirect string, offset: 0x17f): TrapFrame	
    <17fb>   DW_AT_byte_size   : 76	
    <17fc>   DW_AT_decl_file   : 5	
    <17fd>   DW_AT_decl_line   : 111	
    <17fe>   DW_AT_sibling     : <0x1907>	
 <2><1802>: Abbrev Number: 6 (DW_TAG_member)
    <1803>   DW_AT_name        : edi	
    <1807>   DW_AT_decl_file   : 5	
    <1808>   DW_AT_decl_line   : 112	
    <1809>   DW_AT_type        : <0x17ab>	
    <180d>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1810>: Abbrev Number: 6 (DW_TAG_member)
    <1811>   DW_AT_name        : esi	
    <1815>   DW_AT_decl_file   : 5	
    <1816>   DW_AT_decl_line   : 112	
    <1817>   DW_AT_type        : <0x17ab>	
    <181b>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><181e>: Abbrev Number: 6 (DW_TAG_member)
    <181f>   DW_AT_name        : ebp	
    <1823>   DW_AT_decl_file   : 5	
    <1824>   DW_AT_decl_line   : 112	
    <1825>   DW_AT_type        : <0x17ab>	
    <1829>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><182c>: Abbrev Number: 6 (DW_TAG_member)
    <182d>   DW_AT_name        : xxx	
    <1831>   DW_AT_decl_file   : 5	
    <1832>   DW_AT_decl_line   : 112	
    <1833>   DW_AT_type        : <0x17ab>	
    <1837>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><183a>: Abbrev Number: 6 (DW_TAG_member)
    <183b>   DW_AT_name        : ebx	
    <183f>   DW_AT_decl_file   : 5	
    <1840>   DW_AT_decl_line   : 112	
    <1841>   DW_AT_type        : <0x17ab>	
    <1845>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><1848>: Abbrev Number: 6 (DW_TAG_member)
    <1849>   DW_AT_name        : edx	
    <184d>   DW_AT_decl_file   : 5	
    <184e>   DW_AT_decl_line   : 112	
    <184f>   DW_AT_type        : <0x17ab>	
    <1853>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><1856>: Abbrev Number: 6 (DW_TAG_member)
    <1857>   DW_AT_name        : ecx	
    <185b>   DW_AT_decl_file   : 5	
    <185c>   DW_AT_decl_line   : 112	
    <185d>   DW_AT_type        : <0x17ab>	
    <1861>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><1864>: Abbrev Number: 6 (DW_TAG_member)
    <1865>   DW_AT_name        : eax	
    <1869>   DW_AT_decl_file   : 5	
    <186a>   DW_AT_decl_line   : 112	
    <186b>   DW_AT_type        : <0x17ab>	
    <186f>   DW_AT_data_member_location: 2 byte block: 23 1c 	(DW_OP_plus_uconst: 28)
 <2><1872>: Abbrev Number: 6 (DW_TAG_member)
    <1873>   DW_AT_name        : gs	
    <1876>   DW_AT_decl_file   : 5	
    <1877>   DW_AT_decl_line   : 113	
    <1878>   DW_AT_type        : <0x17ab>	
    <187c>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><187f>: Abbrev Number: 6 (DW_TAG_member)
    <1880>   DW_AT_name        : fs	
    <1883>   DW_AT_decl_file   : 5	
    <1884>   DW_AT_decl_line   : 113	
    <1885>   DW_AT_type        : <0x17ab>	
    <1889>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><188c>: Abbrev Number: 6 (DW_TAG_member)
    <188d>   DW_AT_name        : es	
    <1890>   DW_AT_decl_file   : 5	
    <1891>   DW_AT_decl_line   : 113	
    <1892>   DW_AT_type        : <0x17ab>	
    <1896>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><1899>: Abbrev Number: 6 (DW_TAG_member)
    <189a>   DW_AT_name        : ds	
    <189d>   DW_AT_decl_file   : 5	
    <189e>   DW_AT_decl_line   : 113	
    <189f>   DW_AT_type        : <0x17ab>	
    <18a3>   DW_AT_data_member_location: 2 byte block: 23 2c 	(DW_OP_plus_uconst: 44)
 <2><18a6>: Abbrev Number: 6 (DW_TAG_member)
    <18a7>   DW_AT_name        : irq	
    <18ab>   DW_AT_decl_file   : 5	
    <18ac>   DW_AT_decl_line   : 114	
    <18ad>   DW_AT_type        : <0x17bd>	
    <18b1>   DW_AT_data_member_location: 2 byte block: 23 30 	(DW_OP_plus_uconst: 48)
 <2><18b4>: Abbrev Number: 7 (DW_TAG_member)
    <18b5>   DW_AT_name        : (indirect string, offset: 0x198): error_code	
    <18b9>   DW_AT_decl_file   : 5	
    <18ba>   DW_AT_decl_line   : 115	
    <18bb>   DW_AT_type        : <0x17ab>	
    <18bf>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><18c2>: Abbrev Number: 6 (DW_TAG_member)
    <18c3>   DW_AT_name        : eip	
    <18c7>   DW_AT_decl_file   : 5	
    <18c8>   DW_AT_decl_line   : 116	
    <18c9>   DW_AT_type        : <0x17ab>	
    <18cd>   DW_AT_data_member_location: 2 byte block: 23 38 	(DW_OP_plus_uconst: 56)
 <2><18d0>: Abbrev Number: 6 (DW_TAG_member)
    <18d1>   DW_AT_name        : cs	
    <18d4>   DW_AT_decl_file   : 5	
    <18d5>   DW_AT_decl_line   : 116	
    <18d6>   DW_AT_type        : <0x17ab>	
    <18da>   DW_AT_data_member_location: 2 byte block: 23 3c 	(DW_OP_plus_uconst: 60)
 <2><18dd>: Abbrev Number: 7 (DW_TAG_member)
    <18de>   DW_AT_name        : (indirect string, offset: 0x189): eflags	
    <18e2>   DW_AT_decl_file   : 5	
    <18e3>   DW_AT_decl_line   : 116	
    <18e4>   DW_AT_type        : <0x17ab>	
    <18e8>   DW_AT_data_member_location: 2 byte block: 23 40 	(DW_OP_plus_uconst: 64)
 <2><18eb>: Abbrev Number: 6 (DW_TAG_member)
    <18ec>   DW_AT_name        : esp	
    <18f0>   DW_AT_decl_file   : 5	
    <18f1>   DW_AT_decl_line   : 117	
    <18f2>   DW_AT_type        : <0x17ab>	
    <18f6>   DW_AT_data_member_location: 2 byte block: 23 44 	(DW_OP_plus_uconst: 68)
 <2><18f9>: Abbrev Number: 6 (DW_TAG_member)
    <18fa>   DW_AT_name        : ss	
    <18fd>   DW_AT_decl_file   : 5	
    <18fe>   DW_AT_decl_line   : 117	
    <18ff>   DW_AT_type        : <0x17ab>	
    <1903>   DW_AT_data_member_location: 2 byte block: 23 48 	(DW_OP_plus_uconst: 72)
 <1><1907>: Abbrev Number: 2 (DW_TAG_typedef)
    <1908>   DW_AT_name        : (indirect string, offset: 0x17f): TrapFrame	
    <190c>   DW_AT_decl_file   : 5	
    <190d>   DW_AT_decl_line   : 118	
    <190e>   DW_AT_type        : <0x17f6>	
 <1><1912>: Abbrev Number: 5 (DW_TAG_structure_type)
    <1913>   DW_AT_name        : (indirect string, offset: 0x210): ListHead	
    <1917>   DW_AT_byte_size   : 8	
    <1918>   DW_AT_decl_file   : 2	
    <1919>   DW_AT_decl_line   : 6	
    <191a>   DW_AT_sibling     : <0x193b>	
 <2><191e>: Abbrev Number: 7 (DW_TAG_member)
    <191f>   DW_AT_name        : (indirect string, offset: 0x219): prev	
    <1923>   DW_AT_decl_file   : 2	
    <1924>   DW_AT_decl_line   : 7	
    <1925>   DW_AT_type        : <0x193b>	
    <1929>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><192c>: Abbrev Number: 7 (DW_TAG_member)
    <192d>   DW_AT_name        : (indirect string, offset: 0x21e): next	
    <1931>   DW_AT_decl_file   : 2	
    <1932>   DW_AT_decl_line   : 7	
    <1933>   DW_AT_type        : <0x193b>	
    <1937>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <1><193b>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <193c>   DW_AT_byte_size   : 4	
    <193d>   DW_AT_type        : <0x1912>	
 <1><1941>: Abbrev Number: 2 (DW_TAG_typedef)
    <1942>   DW_AT_name        : (indirect string, offset: 0x210): ListHead	
    <1946>   DW_AT_decl_file   : 2	
    <1947>   DW_AT_decl_line   : 9	
    <1948>   DW_AT_type        : <0x1912>	
 <1><194c>: Abbrev Number: 9 (DW_TAG_structure_type)
    <194d>   DW_AT_name        : PCB	
    <1951>   DW_AT_byte_size   : 4108	
    <1953>   DW_AT_decl_file   : 6	
    <1954>   DW_AT_decl_line   : 4	
    <1955>   DW_AT_sibling     : <0x1984>	
 <2><1959>: Abbrev Number: 6 (DW_TAG_member)
    <195a>   DW_AT_name        : tf	
    <195d>   DW_AT_decl_file   : 6	
    <195e>   DW_AT_decl_line   : 5	
    <195f>   DW_AT_type        : <0x1984>	
    <1963>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1966>: Abbrev Number: 7 (DW_TAG_member)
    <1967>   DW_AT_name        : (indirect string, offset: 0x1e6): kstack	
    <196b>   DW_AT_decl_file   : 6	
    <196c>   DW_AT_decl_line   : 6	
    <196d>   DW_AT_type        : <0x1986>	
    <1971>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1974>: Abbrev Number: 7 (DW_TAG_member)
    <1975>   DW_AT_name        : (indirect string, offset: 0x1f7): list	
    <1979>   DW_AT_decl_file   : 6	
    <197a>   DW_AT_decl_line   : 7	
    <197b>   DW_AT_type        : <0x1941>	
    <197f>   DW_AT_data_member_location: 3 byte block: 23 84 20 	(DW_OP_plus_uconst: 4100)
 <1><1984>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <1985>   DW_AT_byte_size   : 4	
 <1><1986>: Abbrev Number: 11 (DW_TAG_array_type)
    <1987>   DW_AT_type        : <0x17dd>	
    <198b>   DW_AT_sibling     : <0x1997>	
 <2><198f>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <1990>   DW_AT_type        : <0x17b6>	
    <1994>   DW_AT_upper_bound : 4095	
 <1><1997>: Abbrev Number: 13 (DW_TAG_typedef)
    <1998>   DW_AT_name        : PCB	
    <199c>   DW_AT_decl_file   : 6	
    <199d>   DW_AT_decl_line   : 8	
    <199e>   DW_AT_type        : <0x194c>	
 <1><19a2>: Abbrev Number: 14 (DW_TAG_subprogram)
    <19a3>   DW_AT_name        : cli	
    <19a7>   DW_AT_decl_file   : 3	
    <19a8>   DW_AT_decl_line   : 101	
    <19a9>   DW_AT_prototyped  : 1	
    <19aa>   DW_AT_inline      : 3	(declared as inline and inlined)
 <1><19ab>: Abbrev Number: 15 (DW_TAG_subprogram)
    <19ac>   DW_AT_name        : (indirect string, offset: 0x1ed): wait_intr	
    <19b0>   DW_AT_decl_file   : 3	
    <19b1>   DW_AT_decl_line   : 107	
    <19b2>   DW_AT_inline      : 3	(declared as inline and inlined)
 <1><19b3>: Abbrev Number: 16 (DW_TAG_subprogram)
    <19b4>   DW_AT_name        : (indirect string, offset: 0x32f): list_del	
    <19b8>   DW_AT_decl_file   : 2	
    <19b9>   DW_AT_decl_line   : 36	
    <19ba>   DW_AT_prototyped  : 1	
    <19bb>   DW_AT_inline      : 3	(declared as inline and inlined)
    <19bc>   DW_AT_sibling     : <0x19f0>	
 <2><19c0>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <19c1>   DW_AT_name        : (indirect string, offset: 0xc1): data	
    <19c5>   DW_AT_decl_file   : 2	
    <19c6>   DW_AT_decl_line   : 36	
    <19c7>   DW_AT_type        : <0x19f0>	
 <2><19cb>: Abbrev Number: 18 (DW_TAG_variable)
    <19cc>   DW_AT_name        : (indirect string, offset: 0x1c2): __FUNCTION__	
    <19d0>   DW_AT_type        : <0x1a06>	
    <19d4>   DW_AT_artificial  : 1	
    <19d5>   DW_AT_const_value : (indirect string, offset: 0x32f): list_del	
 <2><19d9>: Abbrev Number: 19 (DW_TAG_variable)
    <19da>   DW_AT_name        : (indirect string, offset: 0x219): prev	
    <19de>   DW_AT_decl_file   : 2	
    <19df>   DW_AT_decl_line   : 38	
    <19e0>   DW_AT_type        : <0x19f0>	
 <2><19e4>: Abbrev Number: 19 (DW_TAG_variable)
    <19e5>   DW_AT_name        : (indirect string, offset: 0x21e): next	
    <19e9>   DW_AT_decl_file   : 2	
    <19ea>   DW_AT_decl_line   : 39	
    <19eb>   DW_AT_type        : <0x19f0>	
 <1><19f0>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <19f1>   DW_AT_byte_size   : 4	
    <19f2>   DW_AT_type        : <0x1941>	
 <1><19f6>: Abbrev Number: 11 (DW_TAG_array_type)
    <19f7>   DW_AT_type        : <0x17ef>	
    <19fb>   DW_AT_sibling     : <0x1a06>	
 <2><19ff>: Abbrev Number: 20 (DW_TAG_subrange_type)
    <1a00>   DW_AT_type        : <0x17b6>	
    <1a04>   DW_AT_upper_bound : 8	
 <1><1a06>: Abbrev Number: 21 (DW_TAG_const_type)
    <1a07>   DW_AT_type        : <0x19f6>	
 <1><1a0b>: Abbrev Number: 16 (DW_TAG_subprogram)
